In [37]:
a = [x for x in range (0, 100)]
print (a)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]

In [38]:
a = []
for i in range (0, 100):
    a.append(i)
print (a)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]

In [6]:
a = []
for i in range (0, 100, 10):
    if i > 0:
        a.append(i)
print (a)

[10, 20, 30, 40, 50, 60, 70, 80, 90]

In [7]:
a = [x for x in range (0, 100) if x % 10 == 0 and x>0]
print (a)

[10, 20, 30, 40, 50, 60, 70, 80, 90]

In [39]:
a = [34, 5, 7, 23]
b = [89, 1, 98]

In [40]:
c = a+b
print(c)

[34, 5, 7, 23, 89, 1, 98]

In [46]:
# Extend is used if you still want to make change to the previous variables
# So, if you want to add one thing to your list, use append(). 
# But if you want to add many things to your list at once, use extend().

a.extend(b)
print(a)

[34, 5, 7, 23, 89, 1, 89, 1, 98, 89, 1, 89, 1, 98]

In [45]:
# If you added elements to a list multiple times using the extend() method, 
# you can remove those elements by using the pop() method.

a.pop()

98

In [36]:
# If you want to remove all the elements from a list at once, 
# you can use the clear() method.

a.clear()
print (a)

[]

In [27]:
# Iterating over a ist and checking membership
list_1 = [x for x in range (0, 100)]
if list_1 == 25:
    print ("True")
    if list_1 == -45:
        print ("False")
        list_1

In [22]:
list_1 = [x for x in range (0, 100)]
print (25 in list_1)
print (-45 in list_1)

True
False

In [25]:
# SORTING
list_1 = [2, 45, 1, -9, 10]
list_1.sort()
list_1

[-9, 1, 2, 10, 45]

In [28]:
list_1.reverse()
list_1

[45, 10, 2, 1, -9]

In [29]:
list_1 = [2, 45, 1, -9, 10]
list_1.sort(reverse = True)
list_1

[45, 10, 2, 1, -9]

In [56]:
import random
list_1 = [random.randint(0,30) for i in range (0,100)]
print(50 in list_1)
print(30 in list_1)
print(26 in list_1)


print(list_1)

False
True
True
[9, 20, 3, 1, 23, 29, 11, 29, 6, 13, 7, 4, 11, 16, 25, 2, 16, 25, 2, 9, 7, 22, 7, 1, 6, 26, 27, 20, 7, 22, 8, 23, 30, 26, 14, 18, 0, 21, 7, 9, 15, 3, 13, 4, 18, 1, 25, 22, 14, 5, 2, 0, 24, 26, 20, 4, 26, 30, 9, 12, 20, 22, 4, 21, 17, 26, 14, 2, 7, 18, 1, 20, 23, 17, 28, 17, 5, 13, 5, 6, 12, 1, 19, 27, 10, 27, 16, 1, 16, 28, 15, 10, 22, 16, 5, 11, 4, 14, 22, 5]

### Assignment
##### Aim: To create and handle lists gracefully
scenario: Generate a list of random numbers and then generate another list from the first one that only contains numbers that are divisible by three. Repeat the experiment a few times. What is the average difference in lenght between the two lists?

In [6]:
# Soln
import random
list1=[random.randint(1,100) for x in range(0, 25)]

print (list1)
list2 =[x for x in list1 if x % 3 == 0 and x > 0]
print (list2)
list3 = [x for x in list2 if x % 2 == 0 and x > 0]
print (list3)
list4 = [x for x in list3 if x % 5 == 0 and x > 0]
print (list4)

a = (len(list1))
b = (len(list2))
c = (len(list3))
d = (len(list4))
sum_len = (a+b+c+d)/4
print ("Sum of all lenght is: ",sum_len)

ave_dif = (a - sum_len) 
print ("The Average difference is: ",ave_dif)

[74, 20, 50, 25, 98, 57, 50, 12, 49, 13, 55, 16, 66, 84, 54, 81, 50, 45, 88, 19, 66, 59, 79, 91, 35]
[57, 12, 66, 84, 54, 81, 45, 66]
[12, 66, 84, 54, 66]
[]
Sum of all lenght is:  9.5
The Average difference is:  15.5

In [12]:
# correction
import random
exper = int(input('Enter number of times'))
avgdiff1 = []
for i in range (exper):
    limit = int(input("Enter Limit: "))
    
    list1=[random.randrange(0,limit) for x in range(0, limit)]
    len1 = len(list1)
    
    listdivby3 = [x for x in list1 if x % 3 == 0 and x > 0]
    lenlistdiv = len(listdivby3)
    
    diff = len1 - lenlistdiv
    avediff = diff/2
    avgdiff1.append(avediff)
avg_diff = sum(avgdiff1)/len(avgdiff1)
return avg_diff

Enter number of times2
Enter Limit:

ValueError: invalid literal for int() with base 10: ''

In [15]:
# correction
import random
exper = int(input('Enter number of times'))
avgdiff1 = []
for i in range (exper):
    limit = int(input("Enter Limit: "))
    list1=[random.randrange(0,limit) for x in range(0, limit)]
    len1 = len(list1)

    listdivby3 = [x for x in list1 if x % 3 == 0 and x > 0]
    lenlistdiv = len(listdivby3)

    diff = len1 - lenlistdiv
    avediff = diff/2
    avgdiff1.append(avediff)
avg_diff = sum(avgdiff1)/len(avgdiff1)
return avg_diff

Enter number of times3
Enter Limit: 3
Enter Limit: 3
Enter Limit: 3

SyntaxError: 'return' outside function (3439656993.py, line 17)

## SET
#### we can create a null set
#### my_null_set = set{()}
#### nullset = {}

In [ ]:
set1 = {"apple", "orange", "banana"}
set2 = {'pear', 'peach', 'mango', 'banana'}

In [22]:
set1 = set({})
set2 = {}
print (type(set1), type(set2))

<class 'set'> <class 'dict'>

### DIctionary
#### dict1 = {'oshin', 'adeniyi', 'sodiq'}

In [23]:
my_dict = {'dayo':'08069686594', 'tayo':'080838343'}
print (len(my_dict))

2

In [24]:
# add new element to dict
my_dict ['taiwo'] = '9749375'
print (len(my_dict))

3

In [26]:
# dictionary dont accept duplicate element
my_dict['dayo'] = '38483'
print (len(my_dict))

3

In [27]:
my_dict

{'dayo': '38483', 'tayo': '080838343', 'taiwo': '9749375'}

In [34]:
# to get tayo number
# practice sets and dictionary
print (my_dict['tayo'])
print (my_dict['tayo'])

080838343
080838343

In [35]:
# Itreating in Dictionary
for i  in my_dict:
    print(i)

dayo
tayo
taiwo

In [36]:
for i  in my_dict:
    print(i, my_dict[i])

dayo 38483
tayo 080838343
taiwo 9749375

In [37]:
for key, value  in my_dict.items():
    print(key, value)

dayo 38483
tayo 080838343
taiwo 9749375

In [38]:
print (my_dict['dayo'])

38483

In [39]:
'bayo' in my_dict

False

In [44]:
# freestyle
letter = "Q"
ascii_code = ord(letter)
# binary_code = bin(ascii_code)
print(ascii_code)

81

In [46]:
# to delet element in a dictionary

In [47]:
list1 = [x for x in range(0,10)]
print(list1)
dict1 = {x: x**2 for x in list1}
print(dict1)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
{0: 0, 1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81}

In [48]:
dict1 = {x: x**x for x in list1}
print(dict1)

{0: 1, 1: 1, 2: 4, 3: 27, 4: 256, 5: 3125, 6: 46656, 7: 823543, 8: 16777216, 9: 387420489}

In [49]:
dict1 = {x: x**4 for x in list1}
print(dict1)

{0: 0, 1: 1, 2: 16, 3: 81, 4: 256, 5: 625, 6: 1296, 7: 2401, 8: 4096, 9: 6561}

## TUPLE
uesd to create data you cannot change

In [52]:
my_tuple = 'Hello'
print(type(my_tuple))
my_tuplee = 'Hello',
print(type(my_tuplee))

<class 'str'>
<class 'tuple'>

In [56]:
my_tuple =(45,)
print(len(my_tuple))

1

Enter a multiline text: Good GOOD Good GOd GOD God
Unique words and occurrences (case sensitive):  {'Good': 2, 'GOOD': 1, 'GOd': 1, 'GOD': 1, 'God': 1}

Unique words and occurrences (case insensitive):  {'good': 3, 'god': 3}

In [15]:
my_tuple = ('Hello',)
print(len(my_tuple))
print(type(my_tuple))

1
<class 'tuple'>

In [18]:
tuple1 = 'Hello', 'There'
tuple12 = tuple1, 45, 'sam'
print(len(tuple12))
print(tuple12)

3
(('Hello', 'There'), 45, 'sam')

### Activity 2:  Analyze a multiline string and generate the unique word count
1. Get a muiltiline text and save it in a python variable
2. Get rid of all new lines in it using string methods
3. Get all the unique words and their occurrences from the string
4. Repeat the step to find unique words and occurrences, without considering case sensitivity.

In [33]:
multiline_text = input("Enter a multiline text: ")

# Remove new lines
multiline_text = multiline_text.replace("\n", " ")

# Split the text into words
words = multiline_text.split()

# Get unique words (case sensitive)
unique_words = set(words)
print("Unique words", unique_words)

# Get occurrences of each unique word (case sensitive)
for word in unique_words:
    print(f"{word} : {words.count(word)}")

Enter a multiline text: male Male MaLE
Unique words {'Male', 'MaLE', 'male'}
Male : 1
MaLE : 1
male : 1

In [34]:
# Get unique words (case insensitive)
unique_words = set([word.lower() for word in words])
print("Unique words (case insensitive): ", unique_words)

# Get occurrences of each unique word (case insensitive)
for word in unique_words:
    print(f"{word} : {words.count(word.lower())}")

Unique words (case insensitive):  {'male'}
male : 1

In [10]:
multiline_text = input("Enter a multiline text: ")

# Remove new lines
multiline_text = multiline_text.replace("\n", " ")

# Split the text into words
words = multiline_text.split()

# Get unique words and occurrences (case sensitive)
unique_words = {}
for word in words:
    if word in unique_words:
        unique_words[word] += 1
    else:
        unique_words[word] = 1

print("Unique words and occurrences (case sensitive): ",'\n', unique_words )

Enter a multiline text: hi
Unique words and occurrences (case sensitive):
 {'hi': 1}

In [14]:
# Get unique words and occurrences (case insensitive)
unique_words = {}
for word in words:
    lower_word = word.lower()
    if lower_word in unique_words:
        unique_words[lower_word] += 1
    else:
        unique_words[lower_word] = 1

print("Unique words and occurrences (case insensitive): ", unique_words)

Unique words and occurrences (case insensitive):  {'hi': 1}

In [37]:
help()

Welcome to Python 3.9's help utility!

If this is your first time using Python, you should definitely check out
the tutorial on the Internet at https://docs.python.org/3.9/tutorial/.

Enter the name of any module, keyword, or topic to get help on writing
Python programs and using Python modules.  To quit this help utility and
return to the interpreter, just type "quit".

To get a list of available modules, keywords, symbols, or topics, type
"modules", "keywords", "symbols", or "topics".  Each module also comes
with a one-line summary of what it does; to list the modules whose name
or summary contain a given string such as "spam", type "modules spam".


You are now leaving help and returning to the Python interpreter.
If you want to ask for help on a particular object directly from the
interpreter, you can type "help(object)".  Executing "help('string')"
has the same effect as typing a particular string at the help> prompt.

ASSIGNMENT SOLUTION

In [10]:
mt = """It is a truth universally acknowledged, that a single man in possession of a good fortune, must be in want of a wife.
 
However little known the feelings or views of such a man may be on his first entering a neighbourhood, this truth is so well fixed in the minds of the surrounding families, that he is considered the rightful property of some one or other of their daughters.
 
"My dear Mr. Bennet," said his lady to him one day, "have you heard that Netherfield Park is let at last?"
 
Mr. Bennet replied that he had not.
 
"But it is," returned she; "for Mrs. Long has just been here, and she told me all about it."
 
Mr. Bennet made no answer.
 
"Do you not want to know who has taken it?" cried his wife impatiently.
 
"You want to tell me, and I have no objection to hearing it."
 
This was invitation enough.
 
"Why, my dear, you must know, Mrs. Long says that Netherfield is taken by a young man of large fortune from the north of England; that he came down on Monday in a chaise and four to see the place, and was so much delighted with it, that he agreed with Mr. Morris immediately; that he is to take possession before Michaelmas, and some of his servants are to be in the house by the end of next week."
 
"What is his name?"
 
"Bingley."
 
"Is he married or single?"
 
"Oh! Single, my dear, to be sure! A single man of large fortune; four or five thousand a year. What a fine thing for our girls!"
 
"How so? How can it affect them?"
 
"My dear Mr. Bennet," replied his wife, "how can you be so tiresome! You must know that I am thinking of his marrying one of them."
 
"Is that his design in settling here?"
 
"Design! Nonsense, how can you talk so! But it is very likely that he may fall in love with one of them, and therefore you must visit him as soon as he comes."
 
"I see no occasion for that. You and the girls may go, or you may send them by themselves, which perhaps will be still better, for as you are as handsome as any of them, Mr. Bingley may like you the best of the party."
 
"My dear, you flatter me. I certainly have had my share of beauty, but I do not pretend to be anything extraordinary now. When a woman has five grown-up daughters, she ought to give over thinking of her own beauty."
 
"In such cases, a woman has not often much beauty to think of."
 
"But, my dear, you must indeed go and see Mr. Bingley when he comes into the neighbourhood."
 
"It is more than I engage for, I assure you."
 
"But consider your daughters. Only think what an establishment it would be for one of them. Sir William and Lady Lucas are determined to go, merely on that account, for in general, you know, they visit no newcomers. Indeed you must go, for it will be impossible for us to visit him if you do not."
 
"You are over-scrupulous, surely. I dare say Mr. Bingley will be very glad to see you; and I will send a few lines by you to assure him of my hearty consent to his marrying whichever he chooses of the girls; though I must throw in a good word for my little Lizzy."
 
"I desire you will do no such thing. Lizzy is not a bit better than the others; and I am sure she is not half so handsome as Jane, nor half so good-humoured as Lydia. But you are always giving her the preference."
 
"They have none of them much to recommend them," replied he; "they are all silly and ignorant like other girls; but Lizzy has something more of quickness than her sisters."
 
"Mr. Bennet, how can you abuse your own children in such a way? You take delight in vexing me. You have no compassion for my poor nerves."
 
"You mistake me, my dear. I have a high respect for your nerves. They are my old friends. I have heard you mention them with consideration these last twenty years at least."
 
"Ah, you do not know what I suffer."
 
"But I hope you will get over it, and live to see many young men of four thousand a year come into the neighbourhood."
 
"It will be no use to us, if twenty such should come, since you will not visit them."
 
"Depend upon it, my dear, that when there are twenty, I will visit them all."
 
Mr. Bennet was so odd a mixture of quick parts, sarcastic humour, reserve, and caprice, that the experience of three-and-twenty years had been insufficient to make his wife understand his character. Her mind was less difficult to develop. She was a woman of mean understanding, little information, and uncertain temper. When she was discontented, she fancied herself nervous. The business of her life was to get her daughters married; its solace was visiting and news. """

In [5]:
len(mt)

4508

In [6]:
type(mt)

str

In [7]:
# Remove new lines
mt = mt.replace("\n", "")

In [8]:
len(mt)

4442

In [9]:
clean_multi = []
for char in mt:
    if char.isalnum():
        clean_multi.append(char)
print(len(clean_multi))

3388

In [11]:
# To remove all special symbol like comma, question mark and all.
cleaned_multi = ""
for char in mt:
    if char == " ":
        cleaned_multi += char
    elif char.isalnum():
        cleaned_multi += char
print(len(cleaned_multi))

4235

In [12]:
words = cleaned_multi.split(' ')

In [13]:
# to get unique words
unique_word = list (set(words))
unique_word.remove('')
print(len(unique_word))

339

In [1]:
# Get unique words and occurrences (case sensitive)
count_occur = {}
for word in words:
    if word in count_occur:
        count_occur[word] += 1
    else:
        count_occur[word] = 1

print("Unique words and occurrences: ",'\n', count_occur )

NameError: name 'words' is not defined

### January 31 
#### ITERATOR
ITERATOR web: 
https://docs.python.org/3/library/itertools.html#itertools.islice

In [42]:
# Exercise get value (1) in 10 million times
# Use an Iterator(itertool) to reduce memory utilization
# Generate a number and repeat it ten million times
# use the  other conventional way to do same thing and compare the size
from itertools import repeat
small_list_of_numbers = repeat(1, times=1000)
# get size of (small)
for i in small_list_of_numbers:
    print(i, end='')

1111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111

In [14]:
# another way to get same answer without using a Iterator (itertools)
# these uses alot of memory

a = [1 for i in range (100)]
for i in a:
    print(i, end='')

1111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111

In [29]:
# to check the memory size used 
from sys import getsizeof
print(getsizeof(small_list_of_numbers))

48

In [30]:
print(getsizeof(a))

920

In [36]:
# To ge the index, number and size
for x, i in enumerate(a):
    print(x, i, getsizeof(i, x))

0 1 28
1 1 28
2 1 28
3 1 28
4 1 28
5 1 28
6 1 28
7 1 28
8 1 28
9 1 28
10 1 28
11 1 28
12 1 28
13 1 28
14 1 28
15 1 28
16 1 28
17 1 28
18 1 28
19 1 28
20 1 28
21 1 28
22 1 28
23 1 28
24 1 28
25 1 28
26 1 28
27 1 28
28 1 28
29 1 28
30 1 28
31 1 28
32 1 28
33 1 28
34 1 28
35 1 28
36 1 28
37 1 28
38 1 28
39 1 28
40 1 28
41 1 28
42 1 28
43 1 28
44 1 28
45 1 28
46 1 28
47 1 28
48 1 28
49 1 28
50 1 28
51 1 28
52 1 28
53 1 28
54 1 28
55 1 28
56 1 28
57 1 28
58 1 28
59 1 28
60 1 28
61 1 28
62 1 28
63 1 28
64 1 28
65 1 28
66 1 28
67 1 28
68 1 28
69 1 28
70 1 28
71 1 28
72 1 28
73 1 28
74 1 28
75 1 28
76 1 28
77 1 28
78 1 28
79 1 28
80 1 28
81 1 28
82 1 28
83 1 28
84 1 28
85 1 28
86 1 28
87 1 28
88 1 28
89 1 28
90 1 28
91 1 28
92 1 28
93 1 28
94 1 28
95 1 28
96 1 28
97 1 28
98 1 28
99 1 28

In [47]:
# Know that python saves different values in different sizes.
from sys import getsizeof
from itertools import repeat

small_list = repeat(1, times=1000)
a = (i for i in range (1, 1000))
b = [i for i in range (1, 1000)]
c = {i for i in range (1, 1000)}

print (type(small_list), getsizeof(small_list))
print (type(a), getsizeof(a))
print (type(b), getsizeof(b))
print (type(c), getsizeof(c))

<class 'itertools.repeat'> 48
<class 'generator'> 112
<class 'list'> 8856
<class 'set'> 32984

# QUEUE
#### queue: FIFO, LILO
#### deque: Allows to add and remove from any direction
#### stack: LIFO, FILO

In [72]:
# STACK
class stack(list):
    def __init__(self):
        list.__init__(self)
        
    def add(self, e):
        self.append(e)
        
    def delete(self):
        self.pop()
    
    
    def insert(self, index, object):
        print ('you cannot insert')

In [74]:
card = stack()
card.add(5)
card.add('A')
card.add(True)
print(card)

card.insert(stack, 45)
print(card)


card.add(8)
print(card)

[5, 'A', True]
you cannot insert
[5, 'A', True]
[5, 'A', True, 8]

In [87]:
# QUEUE [First in first out]
class queue(list):
    def __init__(self):
        list.__init__(self)
        
    def add(self, e):
        self.append(e)
        
    def delete(self, e):
        self.pop(0)
    
    
    def insert(self, index, object):
        print ('cannot insert')

In [88]:
card = queue()
card.add(5)
card.add('A')
card.add(True)
print(card)

card.insert(stack, 45)
print(card)


card.add(8)
print(card)
card.delete(8)
print(card)

[5, 'A', True]
cannot insert
[5, 'A', True]
[5, 'A', True, 8]
['A', True, 8]

In [122]:
# Deque [First in first out]
class deque(list):
    def __init__(self):
        list.__init__(self)
        
    def add(self, e):
        super().append(e)
        
    def add_front(self, e):
        super().insert(0, e)
        
    def delete(self, e):
        super().pop(0)
    
    def delete_front(self, e):
        super().pop()
        
    # @overide
    def insert(self, index, object):
        pass
    
    def append(self, object):
        pass
    
    def pop(self, index, object):
        pass

In [128]:
card = deque()

card.add(20)
print(card)

card.add_front(24)
print(card)

card.add(34)
print(card)

card.delete_front(34)
print(card)

[20]
[24, 20]
[24, 20, 34]
[24, 20]

In [130]:
from functools import partial


def power(a, b):
	return a**b


# partial functions
pow2 = partial(power, b=2)
pow4 = partial(power, b=4)
power_of_5 = partial(power, 5)

print(power(2, 3))
print(pow2(4))
print(pow4(3))
print(power_of_5(2))

print('Function used in partial function pow2 :', pow2.func)
print('Default keywords for pow2 :', pow2.keywords)
print('Default arguments for power_of_5 :', power_of_5.args)

8
16
81
25
Function used in partial function pow2 : <function power at 0x0000023324381310>
Default keywords for pow2 : {'b': 2}
Default arguments for power_of_5 : (5,)

In [138]:
#Lamda [learn]

   Character = Meaning
 - 'r' = Open for reading only
 - 'w' = Open for writing only
 - 'x' = Create new file and open for writing
 - 'a' = Open for writing in append mode. if it exists
 - 'b' = Binary mode
 - 'r' = Test mode (default)
 - '+' = Update mode (both read and write)

In [165]:
file = open('C:/Users/Admin/untitled.txt', 'w')
file.read()

UnsupportedOperation: not readable

In [164]:
# Feb - 02 - 2023
#File management

file = open('C:/Users/Admin/untitled.txt', 'w')
file.write("i am a programmer...")
file.close

In [168]:
# second option to consider close program
# write to file
with open('C:/Users/Admin/testing.txt', 'w') as file:
    file.write("hello world \n")

In [167]:
#Read from file
with open('C:/Users/Admin/testing.txt') as file:
    data = file.read()
    print(data)

hello world

In [170]:
# Append 
with open('C:/Users/Admin/testing.txt', 'a') as file:
    file.write("hello world")

In [175]:
with open('C:/Users/Admin/testing.txt', 'a') as file:
    file.write("hello world...\n")
    
    with open('C:/Users/Admin/testing.txt') as f:
        file.read
    
        print('file', file.closed)
        print('f', f.closed)
        
        print('file', file.closed)
        print('f', f.closed)
    
print('file', file.closed)
print('f', file.closed)

file False
f False
file False
f False
file True
f True

In [188]:
# Writing to file
data_dict = {"india": "Delhi", "France":"Paris", "UK":"London", "USA":"Washington"}
with open('data_temp.text', 'w') as fd:
    for country, capital in data_dict.items():
        fd.write("The Capital of {} is {}\n".format(country, capital))

In [191]:
fd = open('C:/Users/Admin/DATA SCIENCE CLASS/data_temp.text')
f= fd.read()

print(f)

The Capital of india is Delhi
The Capital of France is Paris
The Capital of UK is London
The Capital of USA is Washington

In [225]:
data_dict = {"india": "Delhi", "France":"Paris", "UK":"London", "USA":"Washington"}
with open('data_temp3.text', 'w') as fd:
    for country, capital in data_dict.items():
        fd.write("The Capital of {} is {}".format(country, capital))

In [230]:
# class work. To convert commas to new line and remove white space(.strip)
fd = open('C:/Users/Admin/DATA SCIENCE CLASS/data_temp.text')
f= fd.read().replace(',','\n').strip()

print(f)

The Capital of india is Delhi
 The Capital of France is Paris
 The Capital of UK is London
 The Capital of USA is Washington

In [231]:
with open('data_temp3.text', 'w') as fd:
    print(fd.read())

UnsupportedOperation: not readable

In [227]:
 print(fd.readlines()[1])

IndexError: list index out of range

In [234]:
data_dict = {"india": "Delhi", "France":"Paris", "UK":"London", "USA":"Washington"}
with open('data_temp4.text', 'w') as fd:
    for country, capital in data_dict.items():
        fd.write("The Capital of {} is {}".format(country, capital))

In [235]:
# class work. To convert commas to new line and remove white space(.strip)
fd = open('C:/Users/Admin/DATA SCIENCE CLASS/data_temp.text')
f= fd.read().replace(',','\n').strip()

print(f)

The Capital of india is Delhi
 The Capital of France is Paris
 The Capital of UK is London
 The Capital of USA is Washington

In [261]:
data=[]
with open('data_temp4.text')as fd:
    for line in fd.readlines():
        print(line)
        for x in line:
            
            data.append(x)
        
    
        
        #data.append(line)
#print(data)
        #print(fd.readlines()[2])

The Capital of india is Delhi

The Capital of France is Paris

The Capital of UK is London

The Capital of USA is Washington

In [271]:
with open('data_temp4.text')as fd:
    data = fd.readlines()
    for line in data:
        words = line.strip().split(' ')
        print(words[3])

india
France
UK
USA

# ASSIGNMENT!!!
 - A micro bank has customers that maintain one or two account types with the bank.
 - Customers can perform operations (any of account balance, withdrawal, deposit, transfer) from any of their accounts (Savings, Currents, etc). 

### Every account has the followings: 
 - Account Type,  Account No,   Account Names,   Digits pin,    balance
 - Customer operations require authentication which is be based on both the account no and pin
 - All Customers' operations must be stored (credits, debits, etc).
 - All transactions must be record to file. 
 -- Analyze, design and model micro bank data using file. (all data must be written to file)
 -- You are expected to used OOP, file handling, exception management..
 -- All data must be written in tabular form

In [ ]:
# See BANK ASSIGNMENT in assignment folder

# PANDAS >> NUMPY >> MATPLOTLIB
###### - Pandas is a sublibrary under Numpy, therefor you cannot use pandas without first calling Numpy.

In [2]:
lst1 = [1,2,3]
type(lst1)

list

In [12]:
import numpy as np
array1 = np.array(lst1)
type(array1)

numpy.ndarray

In [3]:
# Python
lst2 = lst1 + lst1
lst2

[1, 2, 3, 1, 2, 3]

In [13]:
# Numpy
array2 = array1 + array1
array2

array([2, 4, 6])

In [20]:
array3 = array1 // array1
array3

array([1, 1, 1])

In [21]:
array3 = array1 / array1
array3

array([1., 1., 1.])

In [22]:
array3 = array1 ** array1
array3

array([ 1,  4, 27])

In [27]:
array3 = array1 == array1
array3

array([ True,  True,  True])

In [28]:
array3 = array1 % array1
array3

array([0, 0, 0])

In [32]:
lst_5 = [i for i in range(1,6)]
lst_5

[1, 2, 3, 4, 5]

In [33]:
array_5 = np.array(lst_5)
array_5

array([1, 2, 3, 4, 5])

In [34]:
import math
math.sin(60)

-0.3048106211022167

In [35]:
math.sin(array_5)

TypeError: only size-1 arrays can be converted to Python scalars

In [39]:
conda install -c conda-forge nodejs

^C

Note: you may need to restart the kernel to use updated packages.

In [36]:
np.sin(array_5)

array([ 0.84147098,  0.90929743,  0.14112001, -0.7568025 , -0.95892427])

In [37]:
print ("Natural Logarithm : ", np.log(array_5))
print ("Base-10 Logarithm : ", np.log10(array_5))
print ("Base-2 Logarithm : ", np.log2(array_5))

Natural Logarithm :  [0.         0.69314718 1.09861229 1.38629436 1.60943791]
Base-10 Logarithm :  [0.         0.30103    0.47712125 0.60205999 0.69897   ]
Base-2 Logarithm :  [0.         1.         1.5849625  2.         2.32192809]

In [50]:
range_val = np.arange(2,16)
range_val

array([ 2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15])

In [55]:
b = np.linspace(1,5,11)
b
# in line space, you tell the programe to partision the 
# number of partision we want will be generated, so the code say, start from 1 to five 
# and generate 11 in the range of value.
# LEAARN more about it.

array([1. , 1.4, 1.8, 2.2, 2.6, 3. , 3.4, 3.8, 4.2, 4.6, 5. ])

In [61]:
np.arange(30,-1,-5)

array([30, 25, 20, 15, 10,  5,  0])

# Multi-dimensional array

In [63]:
list1 = [[1,2,3],[4,5,6],[7,8,9]]
list1

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [64]:
arrayd = np.array(list1)
arrayd

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [72]:
# Exercise
a = [[2,4],[1,4],[3,2]]
a1 = np.array(a)
b = [[6,1],[1,2],[0,7]]
b2 = np.array(b)
c = np.array(a1+b2)
c

array([[8, 5],
       [2, 6],
       [3, 9]])

In [74]:
print(type(c))
print(c.ndim) #dimension
print(c.size) #size
print(c.shape)# shape

<class 'numpy.ndarray'>
2
6
(3, 2)

In [76]:
print (5 * np.ones((3,3)))

[[5. 5. 5.]
 [5. 5. 5.]
 [5. 5. 5.]]

In [79]:
np.eye(4)

array([[1., 0., 0., 0.],
       [0., 1., 0., 0.],
       [0., 0., 1., 0.],
       [0., 0., 0., 1.]])

In [84]:
a = np.random.randint(low = 1, high = 10, size=(4,3))
print (a)

[[9 2 6]
 [3 5 7]
 [8 7 2]
 [5 5 4]]

In [85]:
a = np.random.randint(1,100,30)
print(a)

[92 62  4 55 55 64 29 74 45 31  5 17 69  3 19 79 52 43 73 83 57 27 66 18
 81 61 61 15 90 78]

In [86]:
print (a.shape)

(30,)

In [90]:
print(a.reshape(3, 10))

[[92 62  4 55 55 64 29 74 45 31]
 [ 5 17 69  3 19 79 52 43 73 83]
 [57 27 66 18 81 61 61 15 90 78]]

In [92]:
print(a.reshape(2,3,5))

[[[92 62  4 55 55]
  [64 29 74 45 31]
  [ 5 17 69  3 19]]

 [[79 52 43 73 83]
  [57 27 66 18 81]
  [61 61 15 90 78]]]

In [93]:
print(a.ravel())

[92 62  4 55 55 64 29 74 45 31  5 17 69  3 19 79 52 43 73 83 57 27 66 18
 81 61 61 15 90 78]

In [102]:
mat = np.array(np.linspace(10,100,15))
print (mat)

[ 10.          16.42857143  22.85714286  29.28571429  35.71428571
  42.14285714  48.57142857  55.          61.42857143  67.85714286
  74.28571429  80.71428571  87.14285714  93.57142857 100.        ]

In [103]:
matr = mat.reshape(3,5)
print(matr)

[[ 10.          16.42857143  22.85714286  29.28571429  35.71428571]
 [ 42.14285714  48.57142857  55.          61.42857143  67.85714286]
 [ 74.28571429  80.71428571  87.14285714  93.57142857 100.        ]]

In [104]:
print(mat.shape)
print(matr.shape)

(15,)
(3, 5)

In [105]:
print(mat.ndim)
print(matr.ndim)

1
2

In [106]:
print(mat[mat>50])

[ 55.          61.42857143  67.85714286  74.28571429  80.71428571
  87.14285714  93.57142857 100.        ]

## ARRAY OPERATIONS

In [108]:
mat1 = np.random.randint(1,10,9). reshape(3,3)
mat2 = np.random.randint(1,10,9). reshape(3,3)
print(mat1)
print()
print(mat2)

[[7 1 9]
 [8 9 7]
 [2 2 3]]

[[2 8 1]
 [6 5 5]
 [7 4 1]]

In [113]:
print("Addition:", mat1+mat2)
print("\nMulstiplication:", mat1*mat2)
print("\nDivision:", mat1/mat2)

Addition: [[ 9  9 10]
 [14 14 12]
 [ 9  6  4]]

Mulstiplication: [[14  8  9]
 [48 45 35]
 [14  8  3]]

Division: [[3.5        0.125      9.        ]
 [1.33333333 1.8        1.4       ]
 [0.28571429 0.5        3.        ]]

In [1]:
print("Linear combination: 3*A - 2*B")

Linear combination: 3*A - 2*B

## PANDAS DATAFRAMES
when you want to work with unprocessed data and it is in a tabular form it is called 
dataframe. if it is only one row then it is a series.

In [5]:
import numpy as np
import pandas as pd

In [6]:
my_data = np.matrix('22,66,140;42,70,148;30,62,125;35,62,152')
labels = ['A', 'B', 'C', 'D']
cols = ['Age', 'Height', 'Weight']

In [7]:
print(cols)

['Age', 'Height', 'Weight']

In [8]:
df = pd.DataFrame(my_data)
df

    0   1    2
0  22  66  140
1  42  70  148
2  30  62  125
3  35  62  152

In [9]:
df = pd.DataFrame(data = my_data, columns = cols, index = labels )
df

   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      62     152

In [10]:
# to join data to the dataframe
df['profession'] = ['Doctor', 'Agbero', 'Politician', 'G-boy']

In [11]:
df

   Age  Height  Weight  profession
A   22      66     140      Doctor
B   42      70     148      Agbero
C   30      62     125  Politician
D   35      62     152       G-boy

In [12]:
df['Firstname'] = 'Ayo Bolanle Obi Hush'.split(' ')
df

   Age  Height  Weight  profession Firstname
A   22      66     140      Doctor       Ayo
B   42      70     148      Agbero   Bolanle
C   30      62     125  Politician       Obi
D   35      62     152       G-boy      Hush

In [13]:
df1 = df.set_index('Firstname')
df1

           Age  Height  Weight  profession
Firstname
Ayo         22      66     140      Doctor
Bolanle     42      70     148      Agbero
Obi         30      62     125  Politician
Hush        35      62     152       G-boy

In [14]:
# inplace is used to make the changes to be true. it is preferable to use another variable 
# because any changes it makes is going to be permanent

df2 = df.set_index('Firstname', inplace = True)
df2

In [15]:
df3 = df.reset_index()
df3

  Firstname  Age  Height  Weight  profession
0       Ayo   22      66     140      Doctor
1   Bolanle   42      70     148      Agbero
2       Obi   30      62     125  Politician
3      Hush   35      62     152       G-boy

In [16]:
df

           Age  Height  Weight  profession
Firstname
Ayo         22      66     140      Doctor
Bolanle     42      70     148      Agbero
Obi         30      62     125  Politician
Hush        35      62     152       G-boy

In [23]:
df['Lastname'] = 'Balogun Jegede Jagaban Abass'.split(' ')
df

ValueError: Length of values (4) does not match length of index (9994)

In [18]:
df.reset_index()

  Firstname  Age  Height  Weight  profession Lastname
0       Ayo   22      66     140      Doctor  Balogun
1   Bolanle   42      70     148      Agbero   Jegede
2       Obi   30      62     125  Politician  Jagaban
3      Hush   35      62     152       G-boy    Abass

In [20]:
# to rearrange dataframe
df = df[['Firstname', 'Lastname', 
         'Age', 'Height', 'Weight', 
         'profession']]
df

KeyError: "['Firstname'] not in index"

In [24]:
import numpy as np
import pandas as pd

df = pd.read_excel('C:/Users/Admin/DATA SCIENCE CLASS/data/Sample - Superstore.xls')
df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2016-138688,2016-06-12,2016-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

In [25]:
# df1 = pd.read_excel('C:/Users/Admin/DATA SCIENCE CLASS/data/Sample - Superstore.xls', 'Returns')
# df1.head()

In [26]:
# Filter useful columns
df4 = df[['Row ID','Order ID', 'Order Date', 'Ship Date', 'Customer ID', 'Customer Name', 
        'Country', 'City', 'Region', 'Product ID', 'Product Name', 'Sales', 
         'Quantity', 'Discount', 'Profit'] ]

In [27]:
df4.head()

,Row ID,Order ID,Order Date,Ship Date,Customer ID,Customer Name,Country,City,Region,Product ID,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-11-08,2016-11-11,CG-12520,Claire Gute,United States,Henderson,South,FUR-BO-10001798,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2016-152156,2016-11-08,2016-11-11,CG-12520,Claire Gute,United States,Henderson,South,FUR-CH-10000454,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2016-138688,2016-06-12,2016-06-16,DV-13045,Darrin Van Huff,United States,Los Angeles,West,OFF-LA-10000240,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2015-108966,2015-10-11,2015-10-18,SO-20335,Sean O'Donnell,United States,Fort Lauderdale,South,FUR-TA-10000577,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2015-108966,2015-10-11,2015-10-18,SO-20335,Sean O'Donnell,United States,Fort Lauderdale,South,OFF-ST-10000760,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

In [28]:
df5 = df4.drop('Region', axis = 1)
df5

,Row ID,Order ID,Order Date,Ship Date,Customer ID,Customer Name,Country,City,Product ID,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-11-08,2016-11-11,CG-12520,Claire Gute,United States,Henderson,FUR-BO-10001798,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2016-152156,2016-11-08,2016-11-11,CG-12520,Claire Gute,United States,Henderson,FUR-CH-10000454,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2016-138688,2016-06-12,2016-06-16,DV-13045,Darrin Van Huff,United States,Los Angeles,OFF-LA-10000240,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2015-108966,2015-10-11,2015-10-18,SO-20335,Sean O'Donnell,United States,Fort Lauderdale,FUR-TA-10000577,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2015-108966,2015-10-11,2015-10-18,SO-20335,Sean O'Donnell,United States,Fort Lauderdale,OFF-ST-10000760,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9989,9990,CA-2014-110422,2014-01-21,2014-01-23,TB-21400,Tom Boeckenhauer,United States,Miami,FUR-FU-10001889,Ultra Door Pull Handle,25.2480,3,0.20,4.1028
9990,9991,CA-2017-121258,2017-02-26,2017-03-03,DB-13060,Dave Brooks,United States,Costa Mesa,FUR-FU-10000747,Tenex B1-RE Series Chair Mats for Low Pile Car...,91.9600,2,0.00,15.6332
9991,9992,CA-2017-121258,2017-02-26,2017-03-03,DB-13060,Dave Brooks,United States,Costa Mesa,TEC-PH-10003645,Aastra 57i VoIP phone,258.5760,2,0.20,19.3932
9992,9993,CA-2017-121258,2017-02-26,2017-03-03,DB-13060,Dave Brooks,United States,Costa Mesa,OFF-PA-10004041,"It's Hot Message Books with Stickers, 2 3/4"" x 5""",29.6000,4,0.00,13.3200
9993,9994,CA-2017-119914,2017-05-04,2017-05-09,CC-12220,Chris Cortes,United States,Westminster,OFF-AP-10002684,"Acco 7-Outlet Masterpiece Power Center, Wihtou...",243.1600,2,0.00,72.9480

In [29]:
df4.describe()
# Gives only numeric

            Row ID         Sales     Quantity     Discount       Profit
count  9994.000000   9994.000000  9994.000000  9994.000000  9994.000000
mean   4997.500000    229.858001     3.789574     0.156203    28.656896
std    2885.163629    623.245101     2.225110     0.206452   234.260108
min       1.000000      0.444000     1.000000     0.000000 -6599.978000
25%    2499.250000     17.280000     2.000000     0.000000     1.728750
50%    4997.500000     54.490000     3.000000     0.200000     8.666500
75%    7495.750000    209.940000     5.000000     0.200000    29.364000
max    9994.000000  22638.480000    14.000000     0.800000  8399.976000

In [30]:
df4.head()

,Row ID,Order ID,Order Date,Ship Date,Customer ID,Customer Name,Country,City,Region,Product ID,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-11-08,2016-11-11,CG-12520,Claire Gute,United States,Henderson,South,FUR-BO-10001798,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2016-152156,2016-11-08,2016-11-11,CG-12520,Claire Gute,United States,Henderson,South,FUR-CH-10000454,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2016-138688,2016-06-12,2016-06-16,DV-13045,Darrin Van Huff,United States,Los Angeles,West,OFF-LA-10000240,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2015-108966,2015-10-11,2015-10-18,SO-20335,Sean O'Donnell,United States,Fort Lauderdale,South,FUR-TA-10000577,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2015-108966,2015-10-11,2015-10-18,SO-20335,Sean O'Donnell,United States,Fort Lauderdale,South,OFF-ST-10000760,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

In [31]:
df4.sample()

,Row ID,Order ID,Order Date,Ship Date,Customer ID,Customer Name,Country,City,Region,Product ID,Product Name,Sales,Quantity,Discount,Profit
2630,2631,CA-2015-168186,2015-09-10,2015-09-15,AB-10150,Aimee Bixby,United States,Tulsa,Central,OFF-PA-10000477,Xerox 1952,14.94,3,0.0,7.0218

In [32]:
a = df.sample(3)
b = df.sample(3)
c = df.sample(3)
a

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
2048,2049,CA-2015-142237,2015-07-11,2015-07-13,First Class,CK-12595,Clytie Kelty,Consumer,United States,Philadelphia,...,19134,East,FUR-FU-10004848,Furniture,Furnishings,"Howard Miller 13-3/4"" Diameter Brushed Chrome ...",289.800,7,0.2,36.2250
753,754,CA-2016-110499,2016-04-07,2016-04-09,First Class,YC-21895,Yoseph Carroll,Corporate,United States,San Francisco,...,94110,West,TEC-CO-10002095,Technology,Copiers,Hewlett Packard 610 Color Digital Copier / Pri...,1199.976,3,0.2,374.9925
6315,6316,CA-2014-100762,2014-11-24,2014-11-29,Standard Class,NG-18355,Nat Gilpin,Corporate,United States,Jackson,...,49201,Central,OFF-LA-10003930,Office Supplies,Labels,"Dot Matrix Printer Tape Reel Labels, White, 50...",196.620,2,0.0,96.3438

### 21-02-2023

In [33]:
# Count the number of rows
df4['City'].nunique()

531

In [34]:
# List the values in the row
df4['City'].unique()

array(['Henderson', 'Los Angeles', 'Fort Lauderdale', 'Concord',
       'Seattle', 'Fort Worth', 'Madison', 'West Jordan', 'San Francisco',
       'Fremont', 'Philadelphia', 'Orem', 'Houston', 'Richardson',
       'Naperville', 'Melbourne', 'Eagan', 'Westland', 'Dover',
       'New Albany', 'New York City', 'Troy', 'Chicago', 'Gilbert',
       'Springfield', 'Jackson', 'Memphis', 'Decatur', 'Durham',
       'Columbia', 'Rochester', 'Minneapolis', 'Portland', 'Saint Paul',
       'Aurora', 'Charlotte', 'Orland Park', 'Urbandale', 'Columbus',
       'Bristol', 'Wilmington', 'Bloomington', 'Phoenix', 'Roseville',
       'Independence', 'Pasadena', 'Newark', 'Franklin', 'Scottsdale',
       'San Jose', 'Edmond', 'Carlsbad', 'San Antonio', 'Monroe',
       'Fairfield', 'Grand Prairie', 'Redlands', 'Hamilton', 'Westfield',
       'Akron', 'Denver', 'Dallas', 'Whittier', 'Saginaw', 'Medina',
       'Dublin', 'Detroit', 'Tampa', 'Santa Clara', 'Lakeville',
       'San Diego', 'Brentwood', 'Chapel Hill', 'Morristown',
       'Cincinnati', 'Inglewood', 'Tamarac', 'Colorado Springs',
       'Belleville', 'Taylor', 'Lakewood', 'Arlington', 'Arvada',
       'Hackensack', 'Saint Petersburg', 'Long Beach', 'Hesperia',
       'Murfreesboro', 'Layton', 'Austin', 'Lowell', 'Manchester',
       'Harlingen', 'Tucson', 'Quincy', 'Pembroke Pines', 'Des Moines',
       'Peoria', 'Las Vegas', 'Warwick', 'Miami', 'Huntington Beach',
       'Richmond', 'Louisville', 'Lawrence', 'Canton', 'New Rochelle',
       'Gastonia', 'Jacksonville', 'Auburn', 'Norman', 'Park Ridge',
       'Amarillo', 'Lindenhurst', 'Huntsville', 'Fayetteville',
       'Costa Mesa', 'Parker', 'Atlanta', 'Gladstone', 'Great Falls',
       'Lakeland', 'Montgomery', 'Mesa', 'Green Bay', 'Anaheim',
       'Marysville', 'Salem', 'Laredo', 'Grove City', 'Dearborn',
       'Warner Robins', 'Vallejo', 'Mission Viejo', 'Rochester Hills',
       'Plainfield', 'Sierra Vista', 'Vancouver', 'Cleveland', 'Tyler',
       'Burlington', 'Waynesboro', 'Chester', 'Cary', 'Palm Coast',
       'Mount Vernon', 'Hialeah', 'Oceanside', 'Evanston', 'Trenton',
       'Cottage Grove', 'Bossier City', 'Lancaster', 'Asheville',
       'Lake Elsinore', 'Omaha', 'Edmonds', 'Santa Ana', 'Milwaukee',
       'Florence', 'Lorain', 'Linden', 'Salinas', 'New Brunswick',
       'Garland', 'Norwich', 'Alexandria', 'Toledo', 'Farmington',
       'Riverside', 'Torrance', 'Round Rock', 'Boca Raton',
       'Virginia Beach', 'Murrieta', 'Olympia', 'Washington',
       'Jefferson City', 'Saint Peters', 'Rockford', 'Brownsville',
       'Yonkers', 'Oakland', 'Clinton', 'Encinitas', 'Roswell',
       'Jonesboro', 'Antioch', 'Homestead', 'La Porte', 'Lansing',
       'Cuyahoga Falls', 'Reno', 'Harrisonburg', 'Escondido', 'Royal Oak',
       'Rockville', 'Coral Springs', 'Buffalo', 'Boynton Beach',
       'Gulfport', 'Fresno', 'Greenville', 'Macon', 'Cedar Rapids',
       'Providence', 'Pueblo', 'Deltona', 'Murray', 'Middletown',
       'Freeport', 'Pico Rivera', 'Provo', 'Pleasant Grove', 'Smyrna',
       'Parma', 'Mobile', 'New Bedford', 'Irving', 'Vineland', 'Glendale',
       'Niagara Falls', 'Thomasville', 'Westminster', 'Coppell', 'Pomona',
       'North Las Vegas', 'Allentown', 'Tempe', 'Laguna Niguel',
       'Bridgeton', 'Everett', 'Watertown', 'Appleton', 'Bellevue',
       'Allen', 'El Paso', 'Grapevine', 'Carrollton', 'Kent', 'Lafayette',
       'Tigard', 'Skokie', 'Plano', 'Suffolk', 'Indianapolis', 'Bayonne',
       'Greensboro', 'Baltimore', 'Kenosha', 'Olathe', 'Tulsa', 'Redmond',
       'Raleigh', 'Muskogee', 'Meriden', 'Bowling Green', 'South Bend',
       'Spokane', 'Keller', 'Port Orange', 'Medford', 'Charlottesville',
       'Missoula', 'Apopka', 'Reading', 'Broomfield', 'Paterson',
       'Oklahoma City', 'Chesapeake', 'Lubbock', 'Johnson City',
       'San Bernardino', 'Leominster', 'Bozeman', 'Perth Amboy',
       'Ontario', 'Rancho Cucamonga', 'Moorhead', 'Mesquite', 'Stockton',
       'Ormond Beach', 'Sunnyvale', 'York', 'College Station',
       'Saint Louis', 'Manteca', 'San Angelo', 'Salt Lake City',
       'Knoxville', 'Little Rock', 'Lincoln Park', 'Marion', 'Littleton',
       'Bangor', 'Southaven', 'New Castle', 'Midland', 'Sioux Falls',
       'Fort Collins', 'Clarksville', 'Sacramento', 'Thousand Oaks',
       'Malden', 'Holyoke', 'Albuquerque', 'Sparks', 'Coachella',
       'Elmhurst', 'Passaic', 'North Charleston', 'Newport News',
       'Jamestown', 'Mishawaka', 'La Quinta', 'Tallahassee', 'Nashville',
       'Bellingham', 'Woodstock', 'Haltom City', 'Wheeling',
       'Summerville', 'Hot Springs', 'Englewood', 'Las Cruces', 'Hoover',
       'Frisco', 'Vacaville', 'Waukesha', 'Bakersfield', 'Pompano Beach',
       'Corpus Christi', 'Redondo Beach', 'Orlando', 'Orange',
       'Lake Charles', 'Highland Park', 'Hempstead', 'Noblesville',
       'Apple Valley', 'Mount Pleasant', 'Sterling Heights', 'Eau Claire',
       'Pharr', 'Billings', 'Gresham', 'Chattanooga', 'Meridian',
       'Bolingbrook', 'Maple Grove', 'Woodland', 'Missouri City',
       'Pearland', 'San Mateo', 'Grand Rapids', 'Visalia',
       'Overland Park', 'Temecula', 'Yucaipa', 'Revere', 'Conroe',
       'Tinley Park', 'Dubuque', 'Dearborn Heights', 'Santa Fe',
       'Hickory', 'Carol Stream', 'Saint Cloud', 'North Miami',
       'Plantation', 'Port Saint Lucie', 'Rock Hill', 'Odessa',
       'West Allis', 'Chula Vista', 'Manhattan', 'Altoona', 'Thornton',
       'Champaign', 'Texarkana', 'Edinburg', 'Baytown', 'Greenwood',
       'Woonsocket', 'Superior', 'Bedford', 'Covington', 'Broken Arrow',
       'Miramar', 'Hollywood', 'Deer Park', 'Wichita', 'Mcallen',
       'Iowa City', 'Boise', 'Cranston', 'Port Arthur', 'Citrus Heights',
       'The Colony', 'Daytona Beach', 'Bullhead City', 'Portage', 'Fargo',
       'Elkhart', 'San Gabriel', 'Margate', 'Sandy Springs', 'Mentor',
       'Lawton', 'Hampton', 'Rome', 'La Crosse', 'Lewiston',
       'Hattiesburg', 'Danville', 'Logan', 'Waterbury', 'Athens',
       'Avondale', 'Marietta', 'Yuma', 'Wausau', 'Pasco', 'Oak Park',
       'Pensacola', 'League City', 'Gaithersburg', 'Lehi', 'Tuscaloosa',
       'Moreno Valley', 'Georgetown', 'Loveland', 'Chandler', 'Helena',
       'Kirkwood', 'Waco', 'Frankfort', 'Bethlehem', 'Grand Island',
       'Woodbury', 'Rogers', 'Clovis', 'Jupiter', 'Santa Barbara',
       'Cedar Hill', 'Norfolk', 'Draper', 'Ann Arbor', 'La Mesa',
       'Pocatello', 'Holland', 'Milford', 'Buffalo Grove', 'Lake Forest',
       'Redding', 'Chico', 'Utica', 'Conway', 'Cheyenne', 'Owensboro',
       'Caldwell', 'Kenner', 'Nashua', 'Bartlett', 'Redwood City',
       'Lebanon', 'Santa Maria', 'Des Plaines', 'Longview',
       'Hendersonville', 'Waterloo', 'Cambridge', 'Palatine', 'Beverly',
       'Eugene', 'Oxnard', 'Renton', 'Glenview', 'Delray Beach',
       'Commerce City', 'Texas City', 'Wilson', 'Rio Rancho', 'Goldsboro',
       'Montebello', 'El Cajon', 'Beaumont', 'West Palm Beach', 'Abilene',
       'Normal', 'Saint Charles', 'Camarillo', 'Hillsboro', 'Burbank',
       'Modesto', 'Garden City', 'Atlantic City', 'Longmont', 'Davis',
       'Morgan Hill', 'Clifton', 'Sheboygan', 'East Point', 'Rapid City',
       'Andover', 'Kissimmee', 'Shelton', 'Danbury', 'Sanford',
       'San Marcos', 'Greeley', 'Mansfield', 'Elyria', 'Twin Falls',
       'Coral Gables', 'Romeoville', 'Marlborough', 'Laurel', 'Bryan',
       'Pine Bluff', 'Aberdeen', 'Hagerstown', 'East Orange',
       'Arlington Heights', 'Oswego', 'Coon Rapids', 'San Clemente',
       'San Luis Obispo', 'Springdale', 'Lodi', 'Mason'], dtype=object)

In [35]:
df4.head(2)

,Row ID,Order ID,Order Date,Ship Date,Customer ID,Customer Name,Country,City,Region,Product ID,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-11-08,2016-11-11,CG-12520,Claire Gute,United States,Henderson,South,FUR-BO-10001798,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2016-152156,2016-11-08,2016-11-11,CG-12520,Claire Gute,United States,Henderson,South,FUR-CH-10000454,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [36]:
df4.loc[2:3]

,Row ID,Order ID,Order Date,Ship Date,Customer ID,Customer Name,Country,City,Region,Product ID,Product Name,Sales,Quantity,Discount,Profit
2,3,CA-2016-138688,2016-06-12,2016-06-16,DV-13045,Darrin Van Huff,United States,Los Angeles,West,OFF-LA-10000240,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2015-108966,2015-10-11,2015-10-18,SO-20335,Sean O'Donnell,United States,Fort Lauderdale,South,FUR-TA-10000577,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310

In [1]:
df4.iloc[4]

NameError: name 'df4' is not defined

In [38]:
df5 = df4.copy()
df5

,Row ID,Order ID,Order Date,Ship Date,Customer ID,Customer Name,Country,City,Region,Product ID,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-11-08,2016-11-11,CG-12520,Claire Gute,United States,Henderson,South,FUR-BO-10001798,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2016-152156,2016-11-08,2016-11-11,CG-12520,Claire Gute,United States,Henderson,South,FUR-CH-10000454,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2016-138688,2016-06-12,2016-06-16,DV-13045,Darrin Van Huff,United States,Los Angeles,West,OFF-LA-10000240,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2015-108966,2015-10-11,2015-10-18,SO-20335,Sean O'Donnell,United States,Fort Lauderdale,South,FUR-TA-10000577,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2015-108966,2015-10-11,2015-10-18,SO-20335,Sean O'Donnell,United States,Fort Lauderdale,South,OFF-ST-10000760,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9989,9990,CA-2014-110422,2014-01-21,2014-01-23,TB-21400,Tom Boeckenhauer,United States,Miami,South,FUR-FU-10001889,Ultra Door Pull Handle,25.2480,3,0.20,4.1028
9990,9991,CA-2017-121258,2017-02-26,2017-03-03,DB-13060,Dave Brooks,United States,Costa Mesa,West,FUR-FU-10000747,Tenex B1-RE Series Chair Mats for Low Pile Car...,91.9600,2,0.00,15.6332
9991,9992,CA-2017-121258,2017-02-26,2017-03-03,DB-13060,Dave Brooks,United States,Costa Mesa,West,TEC-PH-10003645,Aastra 57i VoIP phone,258.5760,2,0.20,19.3932
9992,9993,CA-2017-121258,2017-02-26,2017-03-03,DB-13060,Dave Brooks,United States,Costa Mesa,West,OFF-PA-10004041,"It's Hot Message Books with Stickers, 2 3/4"" x 5""",29.6000,4,0.00,13.3200
9993,9994,CA-2017-119914,2017-05-04,2017-05-09,CC-12220,Chris Cortes,United States,Westminster,West,OFF-AP-10002684,"Acco 7-Outlet Masterpiece Power Center, Wihtou...",243.1600,2,0.00,72.9480

In [39]:
df5.set_index('Row ID', inplace = True)
df5

,Order ID,Order Date,Ship Date,Customer ID,Customer Name,Country,City,Region,Product ID,Product Name,Sales,Quantity,Discount,Profit
Row ID,,,,,,,,,,,,,,
1,CA-2016-152156,2016-11-08,2016-11-11,CG-12520,Claire Gute,United States,Henderson,South,FUR-BO-10001798,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
2,CA-2016-152156,2016-11-08,2016-11-11,CG-12520,Claire Gute,United States,Henderson,South,FUR-CH-10000454,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
3,CA-2016-138688,2016-06-12,2016-06-16,DV-13045,Darrin Van Huff,United States,Los Angeles,West,OFF-LA-10000240,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
4,US-2015-108966,2015-10-11,2015-10-18,SO-20335,Sean O'Donnell,United States,Fort Lauderdale,South,FUR-TA-10000577,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
5,US-2015-108966,2015-10-11,2015-10-18,SO-20335,Sean O'Donnell,United States,Fort Lauderdale,South,OFF-ST-10000760,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9990,CA-2014-110422,2014-01-21,2014-01-23,TB-21400,Tom Boeckenhauer,United States,Miami,South,FUR-FU-10001889,Ultra Door Pull Handle,25.2480,3,0.20,4.1028
9991,CA-2017-121258,2017-02-26,2017-03-03,DB-13060,Dave Brooks,United States,Costa Mesa,West,FUR-FU-10000747,Tenex B1-RE Series Chair Mats for Low Pile Car...,91.9600,2,0.00,15.6332
9992,CA-2017-121258,2017-02-26,2017-03-03,DB-13060,Dave Brooks,United States,Costa Mesa,West,TEC-PH-10003645,Aastra 57i VoIP phone,258.5760,2,0.20,19.3932
9993,CA-2017-121258,2017-02-26,2017-03-03,DB-13060,Dave Brooks,United States,Costa Mesa,West,OFF-PA-10004041,"It's Hot Message Books with Stickers, 2 3/4"" x 5""",29.6000,4,0.00,13.3200
9994,CA-2017-119914,2017-05-04,2017-05-09,CC-12220,Chris Cortes,United States,Westminster,West,OFF-AP-10002684,"Acco 7-Outlet Masterpiece Power Center, Wihtou...",243.1600,2,0.00,72.9480

In [40]:
# to filter based on column
df5_subset = df5[['Customer Name', 'City', 'Product ID',
                    'Product Name', 'Sales', 'Quantity', 'Discount',
                    'Profit', ]]
df5_subset

,Customer Name,City,Product ID,Product Name,Sales,Quantity,Discount,Profit
Row ID,,,,,,,,
1,Claire Gute,Henderson,FUR-BO-10001798,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
2,Claire Gute,Henderson,FUR-CH-10000454,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
3,Darrin Van Huff,Los Angeles,OFF-LA-10000240,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
4,Sean O'Donnell,Fort Lauderdale,FUR-TA-10000577,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
5,Sean O'Donnell,Fort Lauderdale,OFF-ST-10000760,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164
...,...,...,...,...,...,...,...,...
9990,Tom Boeckenhauer,Miami,FUR-FU-10001889,Ultra Door Pull Handle,25.2480,3,0.20,4.1028
9991,Dave Brooks,Costa Mesa,FUR-FU-10000747,Tenex B1-RE Series Chair Mats for Low Pile Car...,91.9600,2,0.00,15.6332
9992,Dave Brooks,Costa Mesa,TEC-PH-10003645,Aastra 57i VoIP phone,258.5760,2,0.20,19.3932
9993,Dave Brooks,Costa Mesa,OFF-PA-10004041,"It's Hot Message Books with Stickers, 2 3/4"" x 5""",29.6000,4,0.00,13.3200
9994,Chris Cortes,Westminster,OFF-AP-10002684,"Acco 7-Outlet Masterpiece Power Center, Wihtou...",243.1600,2,0.00,72.9480

In [41]:
# to filter based on row
# Study loc very well.
df5_subset = df5.loc[[i for i in range (100,200)], ['Customer Name', 'City', 'Product ID',
                    'Product Name', 'Sales', 'Quantity', 'Discount',
                    'Profit']]
df5_subset

,Customer Name,City,Product ID,Product Name,Sales,Quantity,Discount,Profit
Row ID,,,,,,,,
100,Rick Bensley,Chicago,OFF-PA-10003256,Avery Personal Creations Heavyweight Cards,64.624,7,0.2,22.6184
101,Rick Bensley,Chicago,TEC-AC-10001767,SanDisk Ultra 64 GB MicroSDHC Class 10 Memory ...,95.976,3,0.2,-10.7973
102,Rick Bensley,Chicago,OFF-BI-10002609,Avery Hidden Tab Dividers for Binding Systems,1.788,3,0.8,-3.0396
103,Gary Zandusky,Rochester,OFF-PA-10004040,Universal Premium White Copier/Laser Paper (20...,23.920,4,0.0,11.7208
104,Lena Cacioppo,Aurora,TEC-AC-10001552,Logitech K350 2.4Ghz Wireless Keyboard,238.896,6,0.2,-26.8758
...,...,...,...,...,...,...,...,...
195,Mary Zewe,Redlands,OFF-EN-10001509,Poly String Tie Envelopes,14.280,7,0.0,6.7116
196,Cassandra Brandow,Hamilton,OFF-AR-10004685,Binney & Smith Crayola Metallic Colored Pencil...,7.408,2,0.2,1.2038
197,Cassandra Brandow,Hamilton,OFF-AR-10004027,Binney & Smith inkTank Erasable Desk Highlight...,6.048,3,0.2,1.5876
198,Valerie Mitchum,Westfield,OFF-ST-10001414,Decoflex Hanging Personal Folder File,46.260,3,0.0,12.0276
199,Fred Hopkins,Philadelphia,OFF-BI-10000343,"Pressboard Covers with Storage Hooks, 9 1/2"" x...",2.946,2,0.7,-2.2586

In [42]:
df5_subset['City'].nunique()

34

In [43]:
df5_subset['City'].unique()

array(['Chicago', 'Rochester', 'Aurora', 'Charlotte', 'Orland Park',
       'New York City', 'Urbandale', 'Columbus', 'Seattle', 'Bristol',
       'Wilmington', 'Houston', 'Bloomington', 'Phoenix', 'Los Angeles',
       'Roseville', 'Philadelphia', 'San Francisco', 'Independence',
       'Pasadena', 'Newark', 'Franklin', 'Scottsdale', 'San Jose',
       'Edmond', 'Carlsbad', 'San Antonio', 'Decatur', 'Monroe',
       'Fairfield', 'Grand Prairie', 'Redlands', 'Hamilton', 'Westfield'],
      dtype=object)

In [44]:
df5_subset.describe()

             Sales    Quantity    Discount       Profit
count   100.000000  100.000000  100.000000   100.000000
mean    263.442900    4.350000    0.160000     0.515555
std     858.856472    2.633794    0.209858   170.758570
min       1.788000    1.000000    0.000000 -1359.992000
25%      23.304000    2.000000    0.000000     1.635900
50%      66.960000    3.000000    0.200000     9.764900
75%     177.095000    6.000000    0.200000    23.458800
max    8159.952000   14.000000    0.800000   585.552000

In [45]:
df5_subset['Profit'].mean()

0.5155549999999756

In [46]:
df5_subset2 = df5_subset.copy()
df5_subset2.groupby('City').mean()

                     Sales  Quantity  Discount      Profit
City
Aurora          126.046000  4.000000  0.366667  -18.843900
Bloomington     617.700000  6.000000  0.500000 -407.682000
Bristol         157.794000  1.000000  0.700000 -115.715600
Carlsbad         28.400000  5.000000  0.000000   13.348000
Charlotte        35.136000  3.333333  0.200000    6.924933
Chicago          46.999200  3.800000  0.440000  -23.157300
Columbus         51.283714  5.857143  0.228571   13.150586
Decatur         216.780000  4.500000  0.200000   39.250350
Edmond          479.775000  4.500000  0.000000  121.551950
Fairfield         7.160000  2.000000  0.000000    3.436800
Franklin        664.452500  6.750000  0.000000  193.995200
Grand Prairie    28.620000  3.000000  0.200000    4.988700
Hamilton          6.728000  2.500000  0.200000    1.395700
Houston         348.911000  3.500000  0.550000 -125.869700
Independence    839.430000  3.000000  0.000000  218.251800
Los Angeles     139.258286  3.714286  0.057143   18.159714
Monroe          227.636667  3.666667  0.000000   60.088533
New York City   244.889714  4.142857  0.057143   31.890200
Newark          168.856667  5.333333  0.233333   -0.733033
Orland Park     339.960000  5.000000  0.200000   67.992000
Pasadena        671.930000  7.000000  0.000000   20.157900
Philadelphia     46.710000  2.000000  0.366667    3.150333
Phoenix         123.190000  4.500000  0.450000   14.334100
Redlands         14.280000  7.000000  0.000000    6.711600
Rochester        23.920000  4.000000  0.000000   11.720800
Roseville        36.599429  4.714286  0.028571   13.929629
San Antonio    1505.699429  5.285714  0.328571 -268.398457
San Francisco    54.460000  3.000000  0.000000   25.487200
San Jose         81.593333  5.666667  0.000000   31.946333
Scottsdale      180.552000  3.500000  0.200000   16.502400
Seattle         319.852000  2.500000  0.100000   57.083950
Urbandale        51.600000  4.000000  0.000000   18.067800
Westfield        46.260000  3.000000  0.000000   12.027600
Wilmington       97.500000  5.800000  0.000000   33.430200

In [47]:
# df5_subset3 = df5_subset.copy()
# df5_subset3[['Sales','City']].groupby('City').mean()

df5_subset3 = df5_subset.copy()
Gee = df5_subset3[['Sales','City']].groupby('City')
Gee.mean()

                     Sales
City
Aurora          126.046000
Bloomington     617.700000
Bristol         157.794000
Carlsbad         28.400000
Charlotte        35.136000
Chicago          46.999200
Columbus         51.283714
Decatur         216.780000
Edmond          479.775000
Fairfield         7.160000
Franklin        664.452500
Grand Prairie    28.620000
Hamilton          6.728000
Houston         348.911000
Independence    839.430000
Los Angeles     139.258286
Monroe          227.636667
New York City   244.889714
Newark          168.856667
Orland Park     339.960000
Pasadena        671.930000
Philadelphia     46.710000
Phoenix         123.190000
Redlands         14.280000
Rochester        23.920000
Roseville        36.599429
San Antonio    1505.699429
San Francisco    54.460000
San Jose         81.593333
Scottsdale      180.552000
Seattle         319.852000
Urbandale        51.600000
Westfield        46.260000
Wilmington       97.500000

In [48]:
### class work
# get mean for Chicago

# df5_subset3 = df5_subset.copy()
# Gee = df5_subset3[['Sales','City']].groupby('City').loc['Chicago']
# Gee.mean()

df5_subset3 = df5_subset.copy()
pd.DataFrame(df5_subset3.groupby('City').mean().loc['Chicago'])

          Chicago
Sales     46.9992
Quantity   3.8000
Discount   0.4400
Profit   -23.1573

In [49]:
df5_subset3 = df5_subset.copy()
pd.DataFrame(df5_subset3.groupby('City').mean().loc['Chicago'],['Sales']).transpose()

           Sales
Chicago  46.9992

In [50]:
df5_subset3 = df5_subset.copy()
df5_subset3.describe()

             Sales    Quantity    Discount       Profit
count   100.000000  100.000000  100.000000   100.000000
mean    263.442900    4.350000    0.160000     0.515555
std     858.856472    2.633794    0.209858   170.758570
min       1.788000    1.000000    0.000000 -1359.992000
25%      23.304000    2.000000    0.000000     1.635900
50%      66.960000    3.000000    0.200000     9.764900
75%     177.095000    6.000000    0.200000    23.458800
max    8159.952000   14.000000    0.800000   585.552000

In [51]:
df5 = df5_subset3.copy()
df6 = df5.where(df5['City'] == 'Chicago')
pd.DataFrame(df6.mean()).transpose()

C:\Users\Admin\AppData\Local\Temp\ipykernel_3432\4169675450.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  pd.DataFrame(df6.mean()).transpose()

     Sales  Quantity  Discount   Profit
0  46.9992       3.8      0.44 -23.1573

In [52]:
df5 = df5_subset3.copy()
df6 = df5.where(df5['City'] == 'Chicago')
pd.DataFrame(df6.mean()).transpose()

C:\Users\Admin\AppData\Local\Temp\ipykernel_3432\4169675450.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  pd.DataFrame(df6.mean()).transpose()

     Sales  Quantity  Discount   Profit
0  46.9992       3.8      0.44 -23.1573

In [53]:
# MERGE/JOIN CELLS

# Join does it column wise
# merge does it row wise b

In [54]:
import numpy as np
import pandas as pd

df = pd.read_excel('C:/Users/Admin/DATA SCIENCE CLASS/data/Sample - Superstore.xls')
df.head(1)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136

In [55]:
df_2 = pd.read_excel('C:/Users/Admin/DATA SCIENCE CLASS/data/Sample - Superstore.xls', 'Returns')
df_2.head()

  Returned        Order ID
0      Yes  CA-2017-153822
1      Yes  CA-2017-129707
2      Yes  CA-2014-152345
3      Yes  CA-2015-156440
4      Yes  US-2017-155999

In [56]:
df_3 = df.join(df_2.set_index('Order ID'), on = 'Order ID' )
df_3

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,Returned
0,1,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136,NaN
1,2,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820,NaN
2,3,CA-2016-138688,2016-06-12,2016-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714,NaN
3,4,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310,NaN
4,5,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9989,9990,CA-2014-110422,2014-01-21,2014-01-23,Second Class,TB-21400,Tom Boeckenhauer,Consumer,United States,Miami,...,South,FUR-FU-10001889,Furniture,Furnishings,Ultra Door Pull Handle,25.2480,3,0.20,4.1028,NaN
9990,9991,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,West,FUR-FU-10000747,Furniture,Furnishings,Tenex B1-RE Series Chair Mats for Low Pile Car...,91.9600,2,0.00,15.6332,Yes
9991,9992,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,West,TEC-PH-10003645,Technology,Phones,Aastra 57i VoIP phone,258.5760,2,0.20,19.3932,Yes
9992,9993,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,West,OFF-PA-10004041,Office Supplies,Paper,"It's Hot Message Books with Stickers, 2 3/4"" x 5""",29.6000,4,0.00,13.3200,Yes
9993,9994,CA-2017-119914,2017-05-04,2017-05-09,Second Class,CC-12220,Chris Cortes,Consumer,United States,Westminster,...,West,OFF-AP-10002684,Office Supplies,Appliances,"Acco 7-Outlet Masterpiece Power Center, Wihtou...",243.1600,2,0.00,72.9480,NaN

In [57]:
df_3 = df.join(df_2.set_index('Order ID'), on = 'Order ID' )
df_4 = df_3[df_3['Returned'] == 'Yes']
df_4

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,Returned
18,19,CA-2014-143336,2014-08-27,2014-09-01,Second Class,ZD-21925,Zuschuss Donatelli,Consumer,United States,San Francisco,...,West,OFF-AR-10003056,Office Supplies,Art,Newell 341,8.560,2,0.0,2.4824,Yes
19,20,CA-2014-143336,2014-08-27,2014-09-01,Second Class,ZD-21925,Zuschuss Donatelli,Consumer,United States,San Francisco,...,West,TEC-PH-10001949,Technology,Phones,Cisco SPA 501G IP Phone,213.480,3,0.2,16.0110,Yes
20,21,CA-2014-143336,2014-08-27,2014-09-01,Second Class,ZD-21925,Zuschuss Donatelli,Consumer,United States,San Francisco,...,West,OFF-BI-10002215,Office Supplies,Binders,"Wilson Jones Hanging View Binder, White, 1""",22.720,4,0.2,7.3840,Yes
55,56,CA-2016-111682,2016-06-17,2016-06-18,First Class,TB-21055,Ted Butterfield,Consumer,United States,Troy,...,East,OFF-ST-10000604,Office Supplies,Storage,Home/Office Personal File Carts,208.560,6,0.0,52.1400,Yes
56,57,CA-2016-111682,2016-06-17,2016-06-18,First Class,TB-21055,Ted Butterfield,Consumer,United States,Troy,...,East,OFF-PA-10001569,Office Supplies,Paper,Xerox 232,32.400,5,0.0,15.5520,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9957,9958,US-2014-143287,2014-11-11,2014-11-17,Standard Class,KN-16705,Kristina Nunn,Home Office,United States,New Rochelle,...,East,OFF-PA-10004039,Office Supplies,Paper,Xerox 1882,223.920,4,0.0,109.7208,Yes
9958,9959,US-2014-143287,2014-11-11,2014-11-17,Standard Class,KN-16705,Kristina Nunn,Home Office,United States,New Rochelle,...,East,OFF-SU-10001574,Office Supplies,Supplies,Acme Value Line Scissors,7.300,2,0.0,2.1900,Yes
9990,9991,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,West,FUR-FU-10000747,Furniture,Furnishings,Tenex B1-RE Series Chair Mats for Low Pile Car...,91.960,2,0.0,15.6332,Yes
9991,9992,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,West,TEC-PH-10003645,Technology,Phones,Aastra 57i VoIP phone,258.576,2,0.2,19.3932,Yes
9992,9993,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,West,OFF-PA-10004041,Office Supplies,Paper,"It's Hot Message Books with Stickers, 2 3/4"" x 5""",29.600,4,0.0,13.3200,Yes

In [58]:
df.head

<bound method NDFrame.head of       Row ID        Order ID Order Date  Ship Date       Ship Mode  \
0          1  CA-2016-152156 2016-11-08 2016-11-11    Second Class
1          2  CA-2016-152156 2016-11-08 2016-11-11    Second Class
2          3  CA-2016-138688 2016-06-12 2016-06-16    Second Class
3          4  US-2015-108966 2015-10-11 2015-10-18  Standard Class
4          5  US-2015-108966 2015-10-11 2015-10-18  Standard Class
...      ...             ...        ...        ...             ...
9989    9990  CA-2014-110422 2014-01-21 2014-01-23    Second Class
9990    9991  CA-2017-121258 2017-02-26 2017-03-03  Standard Class
9991    9992  CA-2017-121258 2017-02-26 2017-03-03  Standard Class
9992    9993  CA-2017-121258 2017-02-26 2017-03-03  Standard Class
9993    9994  CA-2017-119914 2017-05-04 2017-05-09    Second Class

     Customer ID     Customer Name    Segment        Country             City  \
0       CG-12520       Claire Gute   Consumer  United States        Henderson
1       CG-12520       Claire Gute   Consumer  United States        Henderson
2       DV-13045   Darrin Van Huff  Corporate  United States      Los Angeles
3       SO-20335    Sean O'Donnell   Consumer  United States  Fort Lauderdale
4       SO-20335    Sean O'Donnell   Consumer  United States  Fort Lauderdale
...          ...               ...        ...            ...              ...
9989    TB-21400  Tom Boeckenhauer   Consumer  United States            Miami
9990    DB-13060       Dave Brooks   Consumer  United States       Costa Mesa
9991    DB-13060       Dave Brooks   Consumer  United States       Costa Mesa
9992    DB-13060       Dave Brooks   Consumer  United States       Costa Mesa
9993    CC-12220      Chris Cortes   Consumer  United States      Westminster

      ... Postal Code  Region       Product ID         Category Sub-Category  \
0     ...       42420   South  FUR-BO-10001798        Furniture    Bookcases
1     ...       42420   South  FUR-CH-10000454        Furniture       Chairs
2     ...       90036    West  OFF-LA-10000240  Office Supplies       Labels
3     ...       33311   South  FUR-TA-10000577        Furniture       Tables
4     ...       33311   South  OFF-ST-10000760  Office Supplies      Storage
...   ...         ...     ...              ...              ...          ...
9989  ...       33180   South  FUR-FU-10001889        Furniture  Furnishings
9990  ...       92627    West  FUR-FU-10000747        Furniture  Furnishings
9991  ...       92627    West  TEC-PH-10003645       Technology       Phones
9992  ...       92627    West  OFF-PA-10004041  Office Supplies        Paper
9993  ...       92683    West  OFF-AP-10002684  Office Supplies   Appliances

                                           Product Name     Sales  Quantity  \
0                     Bush Somerset Collection Bookcase  261.9600         2
1     Hon Deluxe Fabric Upholstered Stacking Chairs,...  731.9400         3
2     Self-Adhesive Address Labels for Typewriters b...   14.6200         2
3         Bretford CR4500 Series Slim Rectangular Table  957.5775         5
4                        Eldon Fold 'N Roll Cart System   22.3680         2
...                                                 ...       ...       ...
9989                             Ultra Door Pull Handle   25.2480         3
9990  Tenex B1-RE Series Chair Mats for Low Pile Car...   91.9600         2
9991                              Aastra 57i VoIP phone  258.5760         2
9992  It's Hot Message Books with Stickers, 2 3/4" x 5"   29.6000         4
9993  Acco 7-Outlet Masterpiece Power Center, Wihtou...  243.1600         2

      Discount    Profit
0         0.00   41.9136
1         0.00  219.5820
2         0.00    6.8714
3         0.45 -383.0310
4         0.20    2.5164
...        ...       ...
9989      0.20    4.1028
9990      0.00   15.6332
9991      0.20   19.3932
9992      0.00   13.3200
9993      0.00   72.9480

[9994 rows x 21 columns]>

In [63]:
df_1 = df[['Customer Name', 'State', 'Sales','Profit'].sample(n=4)

SyntaxError: unexpected EOF while parsing (3131378424.py, line 1)

In [80]:
df_slicing = df[['Customer Name','State','Sales','Profit']]
df1 = df_slicing.sample(n=4)
df2 = df_slicing.sample(n=4)
df3 = df_slicing.sample(n=4)

In [81]:
df_cat = pd.concat([df1,df2,df3], axis=0)
df_cat

          Customer Name       State    Sales    Profit
1799         Jill Fjeld       Texas   11.168    3.6296
8080   Kristen Hastings      Oregon  146.544   47.6268
3824      Craig Carroll    New York  879.984  329.9940
8328       Xylona Preis  New Jersey  143.700   68.9760
8856          Jane Waco  California  209.940   39.8886
449        Raymond Buch    New York  263.880   71.2476
5660        Adrian Hane      Oregon   28.680   -7.1700
9777        Luke Foster       Texas  431.136  -26.9460
1381         Julie Kriz    Illinois   83.952  -90.2484
7577        Steven Ward  Washington   52.792    4.6193
4262      Kean Thornton     Georgia   80.480   24.1440
1514  Russell Applegate       Texas    6.744  -11.4648

## MERGE/JOIN
In most cases we use concatenation when they have the same structure
but we merge when we have comon key, There has to be key that is common 
between them.
in the example below we will explain how to join or merge.

In [84]:
df11 = df[['Ship Date','Ship Mode','Customer Name']][0:4]
df12 = df[['Customer Name','Product Name','Quantity']][0:4]

df11

   Ship Date       Ship Mode    Customer Name
0 2016-11-11    Second Class      Claire Gute
1 2016-11-11    Second Class      Claire Gute
2 2016-06-16    Second Class  Darrin Van Huff
3 2015-10-18  Standard Class   Sean O'Donnell

In [85]:
df12

,Customer Name,Product Name,Quantity
0,Claire Gute,Bush Somerset Collection Bookcase,2
1,Claire Gute,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",3
2,Darrin Van Huff,Self-Adhesive Address Labels for Typewriters b...,2
3,Sean O'Donnell,Bretford CR4500 Series Slim Rectangular Table,5

In [90]:
pd.merge(df11,df12, on='Customer Name',how='outer')

,Ship Date,Ship Mode,Customer Name,Product Name,Quantity
0,2016-11-11,Second Class,Claire Gute,Bush Somerset Collection Bookcase,2
1,2016-11-11,Second Class,Claire Gute,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",3
2,2016-11-11,Second Class,Claire Gute,Bush Somerset Collection Bookcase,2
3,2016-11-11,Second Class,Claire Gute,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",3
4,2016-06-16,Second Class,Darrin Van Huff,Self-Adhesive Address Labels for Typewriters b...,2
5,2015-10-18,Standard Class,Sean O'Donnell,Bretford CR4500 Series Slim Rectangular Table,5

In [125]:
#we can use drop_duplicate() to drop unnecessary duplicate rows
# you cannot use unique on a column, it cannot be used on data frame.. drop_duplicate
# is better
pd.merge(df11,df12, on='Customer Name',how='outer').drop_duplicates()

,Ship Date,Ship Mode,Customer Name,Product Name,Quantity
0,2016-11-11,Second Class,Claire Gute,Bush Somerset Collection Bookcase,2
1,2016-11-11,Second Class,Claire Gute,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",3
4,2016-06-16,Second Class,Darrin Van Huff,Self-Adhesive Address Labels for Typewriters b...,2
5,2015-10-18,Standard Class,Sean O'Donnell,Bretford CR4500 Series Slim Rectangular Table,5

# SAMPLE

In [127]:

df_slicing = df[['Customer Name','State','Sales','Profit']]

df1 = df_slicing.sample(n=4)
df3 = df_slicing.sample(frac=0.4)

In [128]:
df3

            Customer Name         State    Sales    Profit
4918        Brendan Murry      Maryland  173.940   38.2668
1793        Thomas Boland         Texas   60.416    6.0416
3316        Edward Becker         Texas  341.960 -427.4500
1583         Naresj Patel      New York   47.040   18.3456
140      Jonathan Doherty  Pennsylvania   82.800   10.3500
...                   ...           ...      ...       ...
4745         Julia Dunbar     Minnesota  127.960   62.7004
8251  Maribeth Schnelling      Illinois  180.980 -470.5480
5984            Joy Smith   Mississippi  185.580   76.0878
7221           Toby Gnade      New York  137.940   35.8644
4882        Thomas Boland      Kentucky   59.920   16.7776

[3998 rows x 4 columns]

# The value_count method
### It returns the count of unique date

In [130]:
df1['Customer Name'].value_counts()[:10]

Beth Thompson     1
Julie Kriz        1
Joni Blumstein    1
Aaron Hawkins     1
Name: Customer Name, dtype: int64

In [ ]:
Example of

In [99]:
import numpy as np
import pandas as pd

candidate = pd.read_csv('C:/Users/Admin/DATA SCIENCE CLASS/fill.csv')
score = pd.read_csv('C:/Users/Admin/DATA SCIENCE CLASS/fill_score.csv')

In [100]:
candidate

  StudentID Firsname  Lastname                            Email
0    ACT123      NaN       NaN                              NaN
1     PS419     Wike    Nyesom  wike.nyesom@yahooyahooparty.com
2     CS123    Yakub   Mahmood              yk.mahmood@inec.com
3     PS100     Bola    Tinubu              jagaban@balablu.com
4     PS001    Atiku  Ababakar                Waziri@dollar.com
5     PS011    Peter       Obi                o.peter@lp.com.ng

In [101]:
score

  StudentID             Course  Score
0    ACT123         Accounting   54.0
1     PS419                NaN    NaN
2     CS123   Computer Science   39.0
3     PS100  Political Science   57.0
4     PS001  Political Science   52.0
5     PS011  Political Science   51.0

In [105]:
pd.merge(candidate,score,on='StudentID',how='outer')

,StudentID,Firsname,Lastname,Email,Course,Score
0,ACT123,NaN,NaN,NaN,Accounting,54.0
1,PS419,Wike,Nyesom,wike.nyesom@yahooyahooparty.com,NaN,NaN
2,CS123,Yakub,Mahmood,yk.mahmood@inec.com,Computer Science,39.0
3,PS100,Bola,Tinubu,jagaban@balablu.com,Political Science,57.0
4,PS001,Atiku,Ababakar,Waziri@dollar.com,Political Science,52.0
5,PS011,Peter,Obi,o.peter@lp.com.ng,Political Science,51.0

In [110]:
# data = score.join(candidate, on='Student', how = 'inner')

In [118]:
data = pd.merge(candidate,score,on='StudentID',how='inner')
data

,StudentID,Firsname,Lastname,Email,Course,Score
0,ACT123,NaN,NaN,NaN,Accounting,54.0
1,PS419,Wike,Nyesom,wike.nyesom@yahooyahooparty.com,NaN,NaN
2,CS123,Yakub,Mahmood,yk.mahmood@inec.com,Computer Science,39.0
3,PS100,Bola,Tinubu,jagaban@balablu.com,Political Science,57.0
4,PS001,Atiku,Ababakar,Waziri@dollar.com,Political Science,52.0
5,PS011,Peter,Obi,o.peter@lp.com.ng,Political Science,51.0

In [120]:
pd.merge(candidate,score,on='StudentID',how='left')

,StudentID,Firsname,Lastname,Email,Course,Score
0,ACT123,NaN,NaN,NaN,Accounting,54.0
1,PS419,Wike,Nyesom,wike.nyesom@yahooyahooparty.com,NaN,NaN
2,CS123,Yakub,Mahmood,yk.mahmood@inec.com,Computer Science,39.0
3,PS100,Bola,Tinubu,jagaban@balablu.com,Political Science,57.0
4,PS001,Atiku,Ababakar,Waziri@dollar.com,Political Science,52.0
5,PS011,Peter,Obi,o.peter@lp.com.ng,Political Science,51.0

In [131]:
# instead of transpose, we can Pivot Table

In [132]:
b = df.pivot_table (values = ['Sales','Quantity','Profit'], 
                    index = ['Region','State'], aggfunc='mean' )

In [133]:
b

                                  Profit  Quantity        Sales
Region  State
Central Illinois              -25.625787  3.750000   162.939230
        Indiana               123.375411  3.879195   359.431946
        Iowa                   39.460397  3.733333   152.658667
        Kansas                 34.851813  3.083333   121.429583
        Michigan               95.934069  3.709804   299.096525
        Minnesota             121.608847  3.719101   335.541011
        Missouri               97.518341  3.818182   336.441667
        Nebraska               53.607742  3.578947   196.445526
        North Dakota           32.878529  4.285714   131.415714
        Oklahoma               73.544788  3.742424   298.233182
        South Dakota           32.902358  3.500000   109.630000
        Texas                 -26.121174  3.780711   172.779742
        Wisconsin              76.380004  4.209091   291.951000
East    Connecticut            42.823071  3.426829   163.223866
        Delaware              103.930988  3.822917   285.948635
        District of Columbia  105.958930  4.000000   286.502000
        Maine                  56.810775  4.375000   158.816250
        Maryland               66.963608  4.000000   225.766886
        Massachusetts          50.262975  3.637037   212.106919
        New Hampshire          63.203807  4.703704   270.093481
        New Jersey             75.176260  3.492308   275.110092
        New York               65.637011  3.744681   275.599531
        Ohio                  -36.186304  3.750533   166.861697
        Pennsylvania          -26.507598  3.667802   198.487077
        Rhode Island          130.100523  3.553571   404.070643
        Vermont               204.088936  4.545455   811.760909
        West Virginia          46.480400  4.500000   302.456000
South   Alabama                94.865989  4.196721   319.846557
        Arkansas               66.811452  4.000000   194.635500
        Florida                -8.875461  3.600522   233.612815
        Georgia                88.315453  3.831522   266.825217
        Kentucky               80.573357  3.762590   263.250000
        Louisiana              52.288150  3.714286   219.453095
        Mississippi            59.867475  4.169811   203.232830
        North Carolina        -30.083985  3.947791   223.305880
        South Carolina         42.120395  4.095238   201.945476
        Tennessee             -29.189583  3.721311   167.551219
        Virginia               83.026564  3.986607   315.342500
West    Arizona               -15.303235  3.848214   157.508933
        California             38.171608  3.831584   228.729451
        Colorado              -35.867351  3.807692   176.418231
        Idaho                  39.367767  3.047619   208.689810
        Montana               122.221900  3.733333   372.623467
        Nevada                 85.045279  4.307692   428.951333
        New Mexico             31.273408  4.081081   129.284378
        Oregon                 -9.600569  4.024194   140.573790
        Utah                   48.047802  4.132075   211.699170
        Washington             66.013146  3.721344   273.994605
        Wyoming               100.196000  4.000000  1603.136000

In [135]:
b.transpose()

Region       Central                                                  \
State       Illinois     Indiana        Iowa      Kansas    Michigan
Profit    -25.625787  123.375411   39.460397   34.851813   95.934069
Quantity    3.750000    3.879195    3.733333    3.083333    3.709804
Sales     162.939230  359.431946  152.658667  121.429583  299.096525

Region                                                                 ...  \
State      Minnesota    Missouri    Nebraska North Dakota    Oklahoma  ...
Profit    121.608847   97.518341   53.607742    32.878529   73.544788  ...
Quantity    3.719101    3.818182    3.578947     4.285714    3.742424  ...
Sales     335.541011  336.441667  196.445526   131.415714  298.233182  ...

Region          West                                                  \
State     California    Colorado       Idaho     Montana      Nevada
Profit     38.171608  -35.867351   39.367767  122.221900   85.045279
Quantity    3.831584    3.807692    3.047619    3.733333    4.307692
Sales     228.729451  176.418231  208.689810  372.623467  428.951333

Region
State     New Mexico      Oregon        Utah  Washington   Wyoming
Profit     31.273408   -9.600569   48.047802   66.013146   100.196
Quantity    4.081081    4.024194    4.132075    3.721344     4.000
Sales     129.284378  140.573790  211.699170  273.994605  1603.136

[3 rows x 49 columns]

In [137]:
df2

        Customer Name         State   Sales   Profit
7383  Alejandro Grove      Nebraska  17.610   8.4528
6087    Eric Hoffmann    California  29.220  12.8568
9917   Tamara Manning          Iowa  14.910   4.6221
316          Sung Pak  Pennsylvania  99.136   8.6744

In [ ]:
# .transpose()

In [144]:
df3.sort_values(by = 'State')

            Customer Name      State    Sales    Profit
6254      Victoria Wilson    Alabama    21.36    8.1168
8338         Tamara Chand    Alabama   498.00  184.2600
9669             Amy Hunt    Alabama    14.94    6.8724
3500        Joe Kamberova    Alabama    62.94   30.2112
2739        Edward Becker    Alabama   477.24    9.5448
...                   ...        ...      ...       ...
7990         Matt Abelman  Wisconsin     1.98    0.8910
5078  Catherine Glotzbach  Wisconsin    18.24    8.5728
9377         Dave Poirier  Wisconsin    32.56    8.4656
2941     Justin Deggeller  Wisconsin  1526.56  427.4368
6850        Jack O'Briant  Wisconsin  1565.88  407.1288

[3998 rows x 4 columns]

In [145]:
df3.sort_values(by = ['State','Sales'])

         Customer Name      State    Sales    Profit
3447     Kristina Nunn    Alabama     3.76    1.0904
6923     Maurice Satty    Alabama     7.38    3.3948
3481   Pauline Johnson    Alabama     8.96    2.7776
1269      Dan Campbell    Alabama    12.48    5.6160
9669          Amy Hunt    Alabama    14.94    6.8724
...                ...        ...      ...       ...
5728     Jeremy Pistek  Wisconsin  1089.75  305.1300
8562         Denny Joy  Wisconsin  1454.90  378.2740
2941  Justin Deggeller  Wisconsin  1526.56  427.4368
6850     Jack O'Briant  Wisconsin  1565.88  407.1288
9513       Bobby Elias  Wisconsin  1649.75  544.4175

[3998 rows x 4 columns]

# How to create function and apply function to a data frame?

In [1]:
def categorize_sales(price):
    if price < 50:
        return 'Low'
    elif price < 200:
        return 'Medium'
    else:
        return 'High'

In [2]:
categorize_sales (160)

'Medium'

In [3]:
df_4 = df[['Sales','Profit', 'State']]
df_4

NameError: name 'df' is not defined

In [156]:
df_4['Sale Price Category'] = df_4['Sales'].apply(categorize_sales)
df_4

C:\Users\Admin\AppData\Local\Temp\ipykernel_3432\2600316646.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_4['Sale Price Category'] = df_4['Sales'].apply(categorize_sales)

         Sales    Profit       State Sale Price Category
0     261.9600   41.9136    Kentucky                High
1     731.9400  219.5820    Kentucky                High
2      14.6200    6.8714  California                 Low
3     957.5775 -383.0310     Florida                High
4      22.3680    2.5164     Florida                 Low
...        ...       ...         ...                 ...
9989   25.2480    4.1028     Florida                 Low
9990   91.9600   15.6332  California              Medium
9991  258.5760   19.3932  California                High
9992   29.6000   13.3200  California                 Low
9993  243.1600   72.9480  California                High

[9994 rows x 4 columns]

# INTRODUCTION TO BEAUTIFUL SOUP 4 and WEB PAGE PARSING
# 23-03-23

In [29]:
# ###  Beautiful soup is a program that allows users to scrap web
# ### Beautiful Soup 4 is a special tool that helps people to look inside a webpage and find information they need. 
# ### It's like having a magic magnifying glass that lets you see the hidden secrets of a webpage.

# ### Sometimes webpages can be really messy and hard to understand. 
# ### Beautiful Soup 4 helps to clean up the messiness and make the important parts easier to find. 
# ### It's like a super-powered cleaning robot for webpages!

# ### Once you have the important information, you can use it to do lots of cool things,
# ### like analyzing the data or creating new websites with the information you found.

# ### So that's what Beautiful Soup 4 does - 
# ### it helps you find and clean up important information on webpages!

In [ ]:
from bs4 import BeautifulSoup

with open('C:/Users/Admin/DATA SCIENCE CLASS/data/test.html', 'r') as fd:
    soup = BeautifulSoup(fd)

    print(type(soup))

In [20]:
print(soup)

<html><body><h1>Lorem ipsum dolor sit amet consectetuer adipiscing
elit</h1>
<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa
<strong>strong</strong>. Cum sociis natoque penatibus
et magnis dis parturient montes, nascetur ridiculus
mus. Donec quam felis, ultricies nec, pellentesque
eu, pretium quis, sem. Nulla consequat massa quis
enim. Donec pede justo, fringilla vel, aliquet nec,
vulputate eget, arcu. In enim justo, rhoncus ut,
imperdiet a, venenatis vitae, justo. Nullam dictum
felis eu pede <a class="external ext" href="#">link</a>
mollis pretium. Integer tincidunt. Cras dapibus.
Vivamus elementum semper nisi. Aenean vulputate
eleifend tellus. Aenean leo ligula, porttitor eu,
consequat vitae, eleifend ac, enim. Aliquam lorem ante,
dapibus in, viverra quis, feugiat a, tellus. Phasellus
viverra nulla ut metus varius laoreet. Quisque rutrum.
Aenean imperdiet. Etiam ultricies nisi vel augue.
Curabitur ullamcorper ultricies nisi.</p>
<h1>Lorem ipsum dolor sit amet consectetuer adipiscing
elit</h1>
<h2>Aenean commodo ligula eget dolor aenean massa</h2>
<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>
<h2>Aenean commodo ligula eget dolor aenean massa</h2>
<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>
<ul>
<li><a href="https://en.wikipedia.org/wiki/Entropy_(information_theory)">Information Entropy</a></li>
<li><a href="http://www.gutenberg.org/browse/scores/top">Top books in Gutenberg</a></li>
<li><a href="https://www.imdb.com/chart/top">Top 250 movies in IMDB</a></li>
</ul>
<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>
<form action="#" method="post">
<fieldset>
<label for="name">Name:</label>
<input id="name" placeholder="Enter your
full name" type="text"/>
<label for="email">Email:</label>
<input id="email" placeholder="Enter
your email address" type="email"/>
<label for="message">Message:</label>
<textarea id="message" placeholder="What's on your
mind?"></textarea>
<input type="submit" value="Send message"/>
</fieldset>
</form>
<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>
<table class="data">
<tr>
<th>Entry Header 1</th>
<th>Entry Header 2</th>
<th>Entry Header 3</th>
<th>Entry Header 4</th>
</tr>
<tr>
<td>Entry First Line 1</td>
<td>Entry First Line 2</td>
<td>Entry First Line 3</td>
<td>Entry First Line 4</td>
</tr>
<tr>
<td>Entry Line 1</td>
<td>Entry Line 2</td>
<td>Entry Line 3</td>
<td>Entry Line 4</td>
</tr>
<tr>
<td>Entry Last Line 1</td>
<td>Entry Last Line 2</td>
<td>Entry Last Line 3</td>
<td>Entry Last Line 4</td>
</tr>
</table>
<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>
</body></html>

In [14]:
all_p = soup.find_all('p')
for p in all_p:
    print(p, '\n')

<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa
<strong>strong</strong>. Cum sociis natoque penatibus
et magnis dis parturient montes, nascetur ridiculus
mus. Donec quam felis, ultricies nec, pellentesque
eu, pretium quis, sem. Nulla consequat massa quis
enim. Donec pede justo, fringilla vel, aliquet nec,
vulputate eget, arcu. In enim justo, rhoncus ut,
imperdiet a, venenatis vitae, justo. Nullam dictum
felis eu pede <a class="external ext" href="#">link</a>
mollis pretium. Integer tincidunt. Cras dapibus.
Vivamus elementum semper nisi. Aenean vulputate
eleifend tellus. Aenean leo ligula, porttitor eu,
consequat vitae, eleifend ac, enim. Aliquam lorem ante,
dapibus in, viverra quis, feugiat a, tellus. Phasellus
viverra nulla ut metus varius laoreet. Quisque rutrum.
Aenean imperdiet. Etiam ultricies nisi vel augue.
Curabitur ullamcorper ultricies nisi.</p>

<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>

<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>

<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>

<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>

<p>Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa.
Cum sociis natoque penatibus et magnis dis parturient
montes, nascetur ridiculus mus. Donec quam felis,
ultricies nec, pellentesque eu, pretium quis, sem.</p>

In [19]:
# get the lenght of all paragraph
print(len(all_p))

6

In [21]:
# print all children of all paragraph
for child in all_p[0].children:
    print(child, '\n')

Lorem ipsum dolor sit amet, consectetuer adipiscing
elit. Aenean commodo ligula eget dolor. Aenean massa


<strong>strong</strong>

. Cum sociis natoque penatibus
et magnis dis parturient montes, nascetur ridiculus
mus. Donec quam felis, ultricies nec, pellentesque
eu, pretium quis, sem. Nulla consequat massa quis
enim. Donec pede justo, fringilla vel, aliquet nec,
vulputate eget, arcu. In enim justo, rhoncus ut,
imperdiet a, venenatis vitae, justo. Nullam dictum
felis eu pede

<a class="external ext" href="#">link</a>


mollis pretium. Integer tincidunt. Cras dapibus.
Vivamus elementum semper nisi. Aenean vulputate
eleifend tellus. Aenean leo ligula, porttitor eu,
consequat vitae, eleifend ac, enim. Aliquam lorem ante,
dapibus in, viverra quis, feugiat a, tellus. Phasellus
viverra nulla ut metus varius laoreet. Quisque rutrum.
Aenean imperdiet. Etiam ultricies nisi vel augue.
Curabitur ullamcorper ultricies nisi.

In [24]:
table = soup.table

for child in table.children:
    print(child)

<tr>
<th>Entry Header 1</th>
<th>Entry Header 2</th>
<th>Entry Header 3</th>
<th>Entry Header 4</th>
</tr>


<tr>
<td>Entry First Line 1</td>
<td>Entry First Line 2</td>
<td>Entry First Line 3</td>
<td>Entry First Line 4</td>
</tr>


<tr>
<td>Entry Line 1</td>
<td>Entry Line 2</td>
<td>Entry Line 3</td>
<td>Entry Line 4</td>
</tr>


<tr>
<td>Entry Last Line 1</td>
<td>Entry Last Line 2</td>
<td>Entry Last Line 3</td>
<td>Entry Last Line 4</td>
</tr>

In [28]:
all_th = soup.find_all('th')
# print(len(all_th))
for col in all_th:
    print(col.get_text())

Entry Header 1
Entry Header 2
Entry Header 3
Entry Header 4

In [30]:
table = soup.table

for descendants in table.descendants:
    print(descendants)

<tr>
<th>Entry Header 1</th>
<th>Entry Header 2</th>
<th>Entry Header 3</th>
<th>Entry Header 4</th>
</tr>


<th>Entry Header 1</th>
Entry Header 1


<th>Entry Header 2</th>
Entry Header 2


<th>Entry Header 3</th>
Entry Header 3


<th>Entry Header 4</th>
Entry Header 4




<tr>
<td>Entry First Line 1</td>
<td>Entry First Line 2</td>
<td>Entry First Line 3</td>
<td>Entry First Line 4</td>
</tr>


<td>Entry First Line 1</td>
Entry First Line 1


<td>Entry First Line 2</td>
Entry First Line 2


<td>Entry First Line 3</td>
Entry First Line 3


<td>Entry First Line 4</td>
Entry First Line 4




<tr>
<td>Entry Line 1</td>
<td>Entry Line 2</td>
<td>Entry Line 3</td>
<td>Entry Line 4</td>
</tr>


<td>Entry Line 1</td>
Entry Line 1


<td>Entry Line 2</td>
Entry Line 2


<td>Entry Line 3</td>
Entry Line 3


<td>Entry Line 4</td>
Entry Line 4




<tr>
<td>Entry Last Line 1</td>
<td>Entry Last Line 2</td>
<td>Entry Last Line 3</td>
<td>Entry Last Line 4</td>
</tr>


<td>Entry Last Line 1</td>
Entry Last Line 1


<td>Entry Last Line 2</td>
Entry Last Line 2


<td>Entry Last Line 3</td>
Entry Last Line 3


<td>Entry Last Line 4</td>
Entry Last Line 4

In [32]:
table = soup.table
for descendants in table.descendants:
    print('Line' in descendants)

False
False
False
False
False
False
False
False
False
False
False
False
False
False
False
False
False
False
False
True
False
False
True
False
False
True
False
False
True
False
False
False
False
False
True
False
False
True
False
False
True
False
False
True
False
False
False
False
False
True
False
False
True
False
False
True
False
False
True
False
False

In [33]:
table = soup.table
for descendants in table.descendants:
    if 'Line' in descendants:
        print(descendants)

Entry First Line 1
Entry First Line 2
Entry First Line 3
Entry First Line 4
Entry Line 1
Entry Line 2
Entry Line 3
Entry Line 4
Entry Last Line 1
Entry Last Line 2
Entry Last Line 3
Entry Last Line 4

In [34]:
pip install html5lib

Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
     ------------------------------------ 112.2/112.2 kB 407.7 kB/s eta 0:00:00
Requirement already satisfied: six>=1.9 in c:\users\admin\anaconda3\lib\site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in c:\users\admin\anaconda3\lib\site-packages (from html5lib) (0.5.1)
Installing collected packages: html5lib
Successfully installed html5lib-1.1
Note: you may need to restart the kernel to use updated packages.

In [38]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\admin\anaconda3\lib\site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in c:\users\admin\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [40]:
import pandas as pd

url = 'https://en.wikipedia.org/wiki/2016_Summer_Olympics_medal_table'
list_of_df = pd.read_html(url)
medal_table = list_of_df[3]
medal_table.set_index('Rank', inplace=True)
medal_table

                                      NOC  Gold  Silver  Bronze  Total
Rank
1                           United States    46      37      38    121
2                           Great Britain    27      23      17     67
3                                   China    26      18      26     70
4                                  Russia    19      17      20     56
5                                 Germany    17      10      15     42
...                                   ...   ...     ...     ...    ...
78                                Nigeria     0       0       1      1
78                               Portugal     0       0       1      1
78                    Trinidad and Tobago     0       0       1      1
78                   United Arab Emirates     0       0       1      1
Totals (86 entries)   Totals (86 entries)   306     307     359    972

[87 rows x 5 columns]

#### Save my finished work as Excel on my file after finishing work

In [41]:

writer = pd.ExcelWriter('test_output.xlsx')
medal_table.to_excel(writer, 'Sheet1')
writer.save()

In [ ]:
# to get all links in a webpage

In [47]:
import requests
from bs4 import BeautifulSoup

# Make a GET request to the page
url = "https://www.example.com"
response = requests.get(url)

# Parse the HTML content of the page
soup = BeautifulSoup(response.content, 'html.parser')

# Find all anchor tags and extract the href attribute (which contains the URL)
links = []
for a_tag in soup.find_all('a'):
    link = a_tag.get('href')
    if link is not None:
        links.append(link)

# Print the list of links
print(links)

['https://www.iana.org/domains/example']

In [48]:
# get al links in a txt file

In [49]:
from bs4 import BeautifulSoup
import requests
with open("C:/Users/Admin/DATA SCIENCE CLASS/data/test.html", "r") as f:
    links = f.read()
soup = BeautifulSoup(links, "html.parser")
all_links = soup.find_all("a")

for link in all_links:
    print(link.get("href"))

#
https://en.wikipedia.org/wiki/Entropy_(information_theory)
http://www.gutenberg.org/browse/scores/top
https://www.imdb.com/chart/top

# >>>>CONNECTING TO DATABASE SYSTEM<<<
## 28-03-2023

In [2]:
# Storage Enine and log management
## this is responsible for efficiently storing and retrieving data on request. The server always manage this

DDL: Data Definition Language
DML: Data Manipulation Language
DCL: Data Control Language
TCL: Transaction Control Language


DDL (Data Definition Language) - used to define the structure of the database schema, 
including creating, Rename, Truncate (to remove all record in table), altering, and dropping 
database objects such as tables, indexes, views, etc.(anytime you use a DDL language, it is auto done and it is permanent.)

DML (Data Manipulation Language) - used to manipulate or change the data within the 
database, including inserting, updating, deleting, Merge and selecting data from tables.

DCL (Data Control Language) - used to control access to the database,
including granting or revoking privileges to users and roles. (Grant, revoke, deny*[only for msql server])

TCL (Transaction Control Language) - used to manage transactions within the database,
including committing or rolling back transactions and setting transaction isolation levels.
properties of transaction: ACID
>>Commit
>>rollback
>>savepoint

In [9]:
import sqlite3

con = sqlite3.connect('DS170123.db')
con

In [10]:
import sqlite3
# varchar is good to save space, cus if it is only char(90) 
# and the person use his name as sodiq..  
# the remaining space will be take back

with sqlite3.connect('DS170123.db') as con:
    cursor = con.cursor()
    stmt = """ CREATE TABLE Student (stud_id integer primary key autoincrement, 
                                                name varchar(255), 
                                                city varchar(255),
                                                pin int) """
    cursor.execute(stmt)

OperationalError: table Student already exists

In [11]:
with sqlite3.connect('DS170123.db') as con:
    cursor = con.cursor()
    stmt = """ insert into student (name, city, pin) values ('Ade', 'Lagos', '1212') """
    
    cursor.execute(stmt)
    #con.commit()

In [12]:
import sqlite3

conn = sqlite3.connect('DS170123.db')
cursor = conn.cursor()
stmt = """ 
    insert into student (name, city, pin) 
    values ('Biodun', 'Abuja', '1111') 
"""
    
cursor.execute(stmt)
conn.commit()
cursor.close()
conn.close()

In [6]:
# ADD MULTIPLE RECORDS

import sqlite3
# varchar is good to save space, cus if it is only char(90) 
# and the person use his name as sodiq..  
# the remaining space will be take back

with sqlite3.connect('DS170123.db') as con:
    cursor = con.cursor()
    record = (('Chika', 'Aba', '0001'),
             ('Chioma', 'Edo', '2122'),
             ('Oshin', 'Ogun', '0100'))
    stmt = """
            insert into student (name, city, pin) values(?, ?, ?)
    """
    cursor.executemany(stmt, record)

In [9]:
import sqlite3
# varchar is good to save space, cus if it is only char(90) 
# and the person use his name as sodiq..  
# the remaining space will be take back

with sqlite3.connect('DS170123.db') as con:
    cursor = con.cursor()
    stmt = """Alter TABLE student alter column pin varchar(4)"""
    cursor.execute(stmt)

OperationalError: near "alter": syntax error

# HADOOP SETUP SETUP
#

In [1]:
pip install findspark

Collecting findspark
  Downloading findspark-2.0.1-py2.py3-none-any.whl (4.4 kB)
Installing collected packages: findspark
Successfully installed findspark-2.0.1
Note: you may need to restart the kernel to use updated packages.

In [5]:
pip install pyspark

Requirement already satisfied: pyspark in c:\users\admin\anaconda3\lib\site-packages (3.3.2)
Requirement already satisfied: py4j==0.10.9.5 in c:\users\admin\anaconda3\lib\site-packages (from pyspark) (0.10.9.5)
Note: you may need to restart the kernel to use updated packages.

In [5]:
pip install jdk

Note: you may need to restart the kernel to use updated packages.

ERROR: Could not find a version that satisfies the requirement jdk (from versions: none)
ERROR: No matching distribution found for jdk

In [5]:
import findspark
findspark.init()

In [6]:
from pyspark import SparkContext
from pyspark.sql import SQLContext
import os

os.environ["JAVA_HOME"] = 'C:\Program Files\Java\jdk-20'

sc = SparkContext()
sqlc = SQLContext(sc)

C:\Users\Admin\anaconda3\lib\site-packages\pyspark\sql\context.py:112: FutureWarning: Deprecated in 3.0.0. Use SparkSession.builder.getOrCreate() instead.
  warnings.warn(

In [8]:
import os
import sys

os.environ['PYSPARK_PYTHON'] = sys.executable
os.environ['PYSPARK_DRIVER_PYTHON'] = sys.executable

data = [('java', 5500),
       ('python', 3500),
       ('django', 3500),
       ('c#', 4500),
       ('React', 3000),
       ("Web Design", 3000)]
df = sqlc.createDataFrame(data)
df.show()

Py4JJavaError: An error occurred while calling o42.showString.
: org.apache.spark.SparkException: Job aborted due to stage failure: Task 0 in stage 0.0 failed 1 times, most recent failure: Lost task 0.0 in stage 0.0 (TID 0) (KKING executor driver): org.apache.spark.SparkException: Python worker failed to connect back.
	at org.apache.spark.api.python.PythonWorkerFactory.createSimpleWorker(PythonWorkerFactory.scala:189)
	at org.apache.spark.api.python.PythonWorkerFactory.create(PythonWorkerFactory.scala:109)
	at org.apache.spark.SparkEnv.createPythonWorker(SparkEnv.scala:124)
	at org.apache.spark.api.python.BasePythonRunner.compute(PythonRunner.scala:157)
	at org.apache.spark.api.python.PythonRDD.compute(PythonRDD.scala:65)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.scheduler.ResultTask.runTask(ResultTask.scala:90)
	at org.apache.spark.scheduler.Task.run(Task.scala:136)
	at org.apache.spark.executor.Executor$TaskRunner.$anonfun$run$3(Executor.scala:548)
	at org.apache.spark.util.Utils$.tryWithSafeFinally(Utils.scala:1504)
	at org.apache.spark.executor.Executor$TaskRunner.run(Executor.scala:551)
	at java.base/java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1144)
	at java.base/java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:642)
	at java.base/java.lang.Thread.run(Thread.java:1623)
Caused by: java.net.SocketTimeoutException: Accept timed out
	at java.base/sun.nio.ch.NioSocketImpl.timedAccept(NioSocketImpl.java:694)
	at java.base/sun.nio.ch.NioSocketImpl.accept(NioSocketImpl.java:738)
	at java.base/java.net.ServerSocket.implAccept(ServerSocket.java:690)
	at java.base/java.net.ServerSocket.platformImplAccept(ServerSocket.java:655)
	at java.base/java.net.ServerSocket.implAccept(ServerSocket.java:631)
	at java.base/java.net.ServerSocket.implAccept(ServerSocket.java:588)
	at java.base/java.net.ServerSocket.accept(ServerSocket.java:546)
	at org.apache.spark.api.python.PythonWorkerFactory.createSimpleWorker(PythonWorkerFactory.scala:176)
	... 29 more

Driver stacktrace:
	at org.apache.spark.scheduler.DAGScheduler.failJobAndIndependentStages(DAGScheduler.scala:2672)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$abortStage$2(DAGScheduler.scala:2608)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$abortStage$2$adapted(DAGScheduler.scala:2607)
	at scala.collection.mutable.ResizableArray.foreach(ResizableArray.scala:62)
	at scala.collection.mutable.ResizableArray.foreach$(ResizableArray.scala:55)
	at scala.collection.mutable.ArrayBuffer.foreach(ArrayBuffer.scala:49)
	at org.apache.spark.scheduler.DAGScheduler.abortStage(DAGScheduler.scala:2607)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$handleTaskSetFailed$1(DAGScheduler.scala:1182)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$handleTaskSetFailed$1$adapted(DAGScheduler.scala:1182)
	at scala.Option.foreach(Option.scala:407)
	at org.apache.spark.scheduler.DAGScheduler.handleTaskSetFailed(DAGScheduler.scala:1182)
	at org.apache.spark.scheduler.DAGSchedulerEventProcessLoop.doOnReceive(DAGScheduler.scala:2860)
	at org.apache.spark.scheduler.DAGSchedulerEventProcessLoop.onReceive(DAGScheduler.scala:2802)
	at org.apache.spark.scheduler.DAGSchedulerEventProcessLoop.onReceive(DAGScheduler.scala:2791)
	at org.apache.spark.util.EventLoop$$anon$1.run(EventLoop.scala:49)
	at org.apache.spark.scheduler.DAGScheduler.runJob(DAGScheduler.scala:952)
	at org.apache.spark.SparkContext.runJob(SparkContext.scala:2238)
	at org.apache.spark.SparkContext.runJob(SparkContext.scala:2259)
	at org.apache.spark.SparkContext.runJob(SparkContext.scala:2278)
	at org.apache.spark.sql.execution.SparkPlan.executeTake(SparkPlan.scala:506)
	at org.apache.spark.sql.execution.SparkPlan.executeTake(SparkPlan.scala:459)
	at org.apache.spark.sql.execution.CollectLimitExec.executeCollect(limit.scala:48)
	at org.apache.spark.sql.Dataset.collectFromPlan(Dataset.scala:3868)
	at org.apache.spark.sql.Dataset.$anonfun$head$1(Dataset.scala:2863)
	at org.apache.spark.sql.Dataset.$anonfun$withAction$2(Dataset.scala:3858)
	at org.apache.spark.sql.execution.QueryExecution$.withInternalError(QueryExecution.scala:510)
	at org.apache.spark.sql.Dataset.$anonfun$withAction$1(Dataset.scala:3856)
	at org.apache.spark.sql.execution.SQLExecution$.$anonfun$withNewExecutionId$6(SQLExecution.scala:109)
	at org.apache.spark.sql.execution.SQLExecution$.withSQLConfPropagated(SQLExecution.scala:169)
	at org.apache.spark.sql.execution.SQLExecution$.$anonfun$withNewExecutionId$1(SQLExecution.scala:95)
	at org.apache.spark.sql.SparkSession.withActive(SparkSession.scala:779)
	at org.apache.spark.sql.execution.SQLExecution$.withNewExecutionId(SQLExecution.scala:64)
	at org.apache.spark.sql.Dataset.withAction(Dataset.scala:3856)
	at org.apache.spark.sql.Dataset.head(Dataset.scala:2863)
	at org.apache.spark.sql.Dataset.take(Dataset.scala:3084)
	at org.apache.spark.sql.Dataset.getRows(Dataset.scala:288)
	at org.apache.spark.sql.Dataset.showString(Dataset.scala:327)
	at java.base/jdk.internal.reflect.DirectMethodHandleAccessor.invoke(DirectMethodHandleAccessor.java:104)
	at java.base/java.lang.reflect.Method.invoke(Method.java:578)
	at py4j.reflection.MethodInvoker.invoke(MethodInvoker.java:244)
	at py4j.reflection.ReflectionEngine.invoke(ReflectionEngine.java:357)
	at py4j.Gateway.invoke(Gateway.java:282)
	at py4j.commands.AbstractCommand.invokeMethod(AbstractCommand.java:132)
	at py4j.commands.CallCommand.execute(CallCommand.java:79)
	at py4j.ClientServerConnection.waitForCommands(ClientServerConnection.java:182)
	at py4j.ClientServerConnection.run(ClientServerConnection.java:106)
	at java.base/java.lang.Thread.run(Thread.java:1623)
Caused by: org.apache.spark.SparkException: Python worker failed to connect back.
	at org.apache.spark.api.python.PythonWorkerFactory.createSimpleWorker(PythonWorkerFactory.scala:189)
	at org.apache.spark.api.python.PythonWorkerFactory.create(PythonWorkerFactory.scala:109)
	at org.apache.spark.SparkEnv.createPythonWorker(SparkEnv.scala:124)
	at org.apache.spark.api.python.BasePythonRunner.compute(PythonRunner.scala:157)
	at org.apache.spark.api.python.PythonRDD.compute(PythonRDD.scala:65)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.scheduler.ResultTask.runTask(ResultTask.scala:90)
	at org.apache.spark.scheduler.Task.run(Task.scala:136)
	at org.apache.spark.executor.Executor$TaskRunner.$anonfun$run$3(Executor.scala:548)
	at org.apache.spark.util.Utils$.tryWithSafeFinally(Utils.scala:1504)
	at org.apache.spark.executor.Executor$TaskRunner.run(Executor.scala:551)
	at java.base/java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1144)
	at java.base/java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:642)
	... 1 more
Caused by: java.net.SocketTimeoutException: Accept timed out
	at java.base/sun.nio.ch.NioSocketImpl.timedAccept(NioSocketImpl.java:694)
	at java.base/sun.nio.ch.NioSocketImpl.accept(NioSocketImpl.java:738)
	at java.base/java.net.ServerSocket.implAccept(ServerSocket.java:690)
	at java.base/java.net.ServerSocket.platformImplAccept(ServerSocket.java:655)
	at java.base/java.net.ServerSocket.implAccept(ServerSocket.java:631)
	at java.base/java.net.ServerSocket.implAccept(ServerSocket.java:588)
	at java.base/java.net.ServerSocket.accept(ServerSocket.java:546)
	at org.apache.spark.api.python.PythonWorkerFactory.createSimpleWorker(PythonWorkerFactory.scala:176)
	... 29 more

##### A quick introduction to
# BIG DATA
##### Big data consist of 5 v'

###### Value
###### Velocity
###### Veracity
###### Volume
###### Variety

In [4]:
# HADOOP
# Apache hadoop is a set of tools for parallel storage and computation. it has two architecture
# HDFS
# YARN

Manipulating data with HDFS

Manipulating data with HDFS is very similar to the Linux commands:

hdfs fs -ls/ : list all folder

USING PYSPARK

Python Spark is like a magic wand that helps you do lots of things quickly and easily with big piles of data.

For example, let's say you have a big pile of toys scattered all over your room. It would take you a long time to pick them all up one by one, but if you had a magic wand, you could wave it and all the toys would fly into the toy box in just a few seconds.

Python Spark does something similar with big piles of data. It helps you process and analyze huge amounts of information quickly and easily, so you can find patterns, make predictions, and solve problems faster.

Some uses of Python Spark include analyzing customer data to make better business decisions, processing large amounts of social media data to track trends and sentiment, and processing scientific data for research purposes.

In [3]:
# to construct a table data froma file and save it to database

import os
import sys

os.environ['PYSPARK_PYTHON'] = sys.executable
os.environ['PYSPARK_DRIVER_PYTHON'] = sys.executable

In [4]:
from pyspark.sql import SparkSession
>>> spark = SparkSession \
    .builder \
    .appName ("Python Spark Session") \
    .getOrCreate()

from pyspark.sql import SQLContext
sqlc = SQLContext(spark)

C:\Users\Admin\anaconda3\lib\site-packages\pyspark\sql\context.py:112: FutureWarning: Deprecated in 3.0.0. Use SparkSession.builder.getOrCreate() instead.
  warnings.warn(

In [8]:
# from pyspark import SparkContext
# sc = SparkContext()
# from pyspark.sql import SQLContext
# sqlc = SQLContext(sc)

In [5]:
from pyspark.sql import *
table = Row ("Name","Age")

In [6]:
row1 = table("Ankit", 24)
row2 = table("Kunle", 34)
row3 = table("pretty", 36)

In [7]:
na_list = [row1, row2, row3]
df_na = sqlc.createDataFrame(na_list)
type(df_na)

pyspark.sql.dataframe.DataFrame

In [8]:
df_na.show()

+------+---+
|  Name|Age|
+------+---+
| Ankit| 24|
| Kunle| 34|
|pretty| 36|
+------+---+

In [15]:
import findspark
findspark.init()

In [16]:
# from pyspark.sql import SparkSession
# >>> spark = SparkSession \
#     .builder 
#     .appName('Python spark session') \
#     .getOrCreate()

from pyspark.sql import SparkSession

spark = SparkSession.builder \
    .appName('Python spark session') \
    .getOrCreate()

In [1]:
from pyspark import SparkContext
sc = SparkContext()
from pyspark.sql import SQLContext
sqlc = SQLContext(sc)

C:\Users\Admin\anaconda3\lib\site-packages\pyspark\sql\context.py:112: FutureWarning: Deprecated in 3.0.0. Use SparkSession.builder.getOrCreate() instead.
  warnings.warn(

In [2]:
from pyspark.sql import*

table = Row('Name', "Age")

In [3]:
row1 = table('Ankit', 23)
row2 = table('Tyler', 34)
row3 = table('Toobi', 36)

In [4]:
na_list = [row1, row2, row3]
df_na = sqlc.createDataFrame(na_list)
type(df_na)

pyspark.sql.dataframe.DataFrame

In [ ]:
# now let's go >>>

In [5]:
df_na.show()

Py4JJavaError: An error occurred while calling o42.showString.
: org.apache.spark.SparkException: Job aborted due to stage failure: Task 0 in stage 0.0 failed 1 times, most recent failure: Lost task 0.0 in stage 0.0 (TID 0) (KKING executor driver): org.apache.spark.SparkException: Python worker failed to connect back.
	at org.apache.spark.api.python.PythonWorkerFactory.createSimpleWorker(PythonWorkerFactory.scala:189)
	at org.apache.spark.api.python.PythonWorkerFactory.create(PythonWorkerFactory.scala:109)
	at org.apache.spark.SparkEnv.createPythonWorker(SparkEnv.scala:124)
	at org.apache.spark.api.python.BasePythonRunner.compute(PythonRunner.scala:157)
	at org.apache.spark.api.python.PythonRDD.compute(PythonRDD.scala:65)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.scheduler.ResultTask.runTask(ResultTask.scala:90)
	at org.apache.spark.scheduler.Task.run(Task.scala:136)
	at org.apache.spark.executor.Executor$TaskRunner.$anonfun$run$3(Executor.scala:548)
	at org.apache.spark.util.Utils$.tryWithSafeFinally(Utils.scala:1504)
	at org.apache.spark.executor.Executor$TaskRunner.run(Executor.scala:551)
	at java.base/java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1144)
	at java.base/java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:642)
	at java.base/java.lang.Thread.run(Thread.java:1623)
Caused by: java.net.SocketTimeoutException: Accept timed out
	at java.base/sun.nio.ch.NioSocketImpl.timedAccept(NioSocketImpl.java:694)
	at java.base/sun.nio.ch.NioSocketImpl.accept(NioSocketImpl.java:738)
	at java.base/java.net.ServerSocket.implAccept(ServerSocket.java:690)
	at java.base/java.net.ServerSocket.platformImplAccept(ServerSocket.java:655)
	at java.base/java.net.ServerSocket.implAccept(ServerSocket.java:631)
	at java.base/java.net.ServerSocket.implAccept(ServerSocket.java:588)
	at java.base/java.net.ServerSocket.accept(ServerSocket.java:546)
	at org.apache.spark.api.python.PythonWorkerFactory.createSimpleWorker(PythonWorkerFactory.scala:176)
	... 29 more

Driver stacktrace:
	at org.apache.spark.scheduler.DAGScheduler.failJobAndIndependentStages(DAGScheduler.scala:2672)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$abortStage$2(DAGScheduler.scala:2608)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$abortStage$2$adapted(DAGScheduler.scala:2607)
	at scala.collection.mutable.ResizableArray.foreach(ResizableArray.scala:62)
	at scala.collection.mutable.ResizableArray.foreach$(ResizableArray.scala:55)
	at scala.collection.mutable.ArrayBuffer.foreach(ArrayBuffer.scala:49)
	at org.apache.spark.scheduler.DAGScheduler.abortStage(DAGScheduler.scala:2607)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$handleTaskSetFailed$1(DAGScheduler.scala:1182)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$handleTaskSetFailed$1$adapted(DAGScheduler.scala:1182)
	at scala.Option.foreach(Option.scala:407)
	at org.apache.spark.scheduler.DAGScheduler.handleTaskSetFailed(DAGScheduler.scala:1182)
	at org.apache.spark.scheduler.DAGSchedulerEventProcessLoop.doOnReceive(DAGScheduler.scala:2860)
	at org.apache.spark.scheduler.DAGSchedulerEventProcessLoop.onReceive(DAGScheduler.scala:2802)
	at org.apache.spark.scheduler.DAGSchedulerEventProcessLoop.onReceive(DAGScheduler.scala:2791)
	at org.apache.spark.util.EventLoop$$anon$1.run(EventLoop.scala:49)
	at org.apache.spark.scheduler.DAGScheduler.runJob(DAGScheduler.scala:952)
	at org.apache.spark.SparkContext.runJob(SparkContext.scala:2238)
	at org.apache.spark.SparkContext.runJob(SparkContext.scala:2259)
	at org.apache.spark.SparkContext.runJob(SparkContext.scala:2278)
	at org.apache.spark.sql.execution.SparkPlan.executeTake(SparkPlan.scala:506)
	at org.apache.spark.sql.execution.SparkPlan.executeTake(SparkPlan.scala:459)
	at org.apache.spark.sql.execution.CollectLimitExec.executeCollect(limit.scala:48)
	at org.apache.spark.sql.Dataset.collectFromPlan(Dataset.scala:3868)
	at org.apache.spark.sql.Dataset.$anonfun$head$1(Dataset.scala:2863)
	at org.apache.spark.sql.Dataset.$anonfun$withAction$2(Dataset.scala:3858)
	at org.apache.spark.sql.execution.QueryExecution$.withInternalError(QueryExecution.scala:510)
	at org.apache.spark.sql.Dataset.$anonfun$withAction$1(Dataset.scala:3856)
	at org.apache.spark.sql.execution.SQLExecution$.$anonfun$withNewExecutionId$6(SQLExecution.scala:109)
	at org.apache.spark.sql.execution.SQLExecution$.withSQLConfPropagated(SQLExecution.scala:169)
	at org.apache.spark.sql.execution.SQLExecution$.$anonfun$withNewExecutionId$1(SQLExecution.scala:95)
	at org.apache.spark.sql.SparkSession.withActive(SparkSession.scala:779)
	at org.apache.spark.sql.execution.SQLExecution$.withNewExecutionId(SQLExecution.scala:64)
	at org.apache.spark.sql.Dataset.withAction(Dataset.scala:3856)
	at org.apache.spark.sql.Dataset.head(Dataset.scala:2863)
	at org.apache.spark.sql.Dataset.take(Dataset.scala:3084)
	at org.apache.spark.sql.Dataset.getRows(Dataset.scala:288)
	at org.apache.spark.sql.Dataset.showString(Dataset.scala:327)
	at java.base/jdk.internal.reflect.DirectMethodHandleAccessor.invoke(DirectMethodHandleAccessor.java:104)
	at java.base/java.lang.reflect.Method.invoke(Method.java:578)
	at py4j.reflection.MethodInvoker.invoke(MethodInvoker.java:244)
	at py4j.reflection.ReflectionEngine.invoke(ReflectionEngine.java:357)
	at py4j.Gateway.invoke(Gateway.java:282)
	at py4j.commands.AbstractCommand.invokeMethod(AbstractCommand.java:132)
	at py4j.commands.CallCommand.execute(CallCommand.java:79)
	at py4j.ClientServerConnection.waitForCommands(ClientServerConnection.java:182)
	at py4j.ClientServerConnection.run(ClientServerConnection.java:106)
	at java.base/java.lang.Thread.run(Thread.java:1623)
Caused by: org.apache.spark.SparkException: Python worker failed to connect back.
	at org.apache.spark.api.python.PythonWorkerFactory.createSimpleWorker(PythonWorkerFactory.scala:189)
	at org.apache.spark.api.python.PythonWorkerFactory.create(PythonWorkerFactory.scala:109)
	at org.apache.spark.SparkEnv.createPythonWorker(SparkEnv.scala:124)
	at org.apache.spark.api.python.BasePythonRunner.compute(PythonRunner.scala:157)
	at org.apache.spark.api.python.PythonRDD.compute(PythonRDD.scala:65)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.rdd.MapPartitionsRDD.compute(MapPartitionsRDD.scala:52)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.scheduler.ResultTask.runTask(ResultTask.scala:90)
	at org.apache.spark.scheduler.Task.run(Task.scala:136)
	at org.apache.spark.executor.Executor$TaskRunner.$anonfun$run$3(Executor.scala:548)
	at org.apache.spark.util.Utils$.tryWithSafeFinally(Utils.scala:1504)
	at org.apache.spark.executor.Executor$TaskRunner.run(Executor.scala:551)
	at java.base/java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1144)
	at java.base/java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:642)
	... 1 more
Caused by: java.net.SocketTimeoutException: Accept timed out
	at java.base/sun.nio.ch.NioSocketImpl.timedAccept(NioSocketImpl.java:694)
	at java.base/sun.nio.ch.NioSocketImpl.accept(NioSocketImpl.java:738)
	at java.base/java.net.ServerSocket.implAccept(ServerSocket.java:690)
	at java.base/java.net.ServerSocket.platformImplAccept(ServerSocket.java:655)
	at java.base/java.net.ServerSocket.implAccept(ServerSocket.java:631)
	at java.base/java.net.ServerSocket.implAccept(ServerSocket.java:588)
	at java.base/java.net.ServerSocket.accept(ServerSocket.java:546)
	at org.apache.spark.api.python.PythonWorkerFactory.createSimpleWorker(PythonWorkerFactory.scala:176)
	... 29 more

In [22]:
# creating a dataframe from  an existing RDD

In [6]:
data = [('Ankit', 34), ('Femi', 22), ('pretty', 24)]
data_rdd = sc.parallelize(data)
type(data_rdd)

pyspark.rdd.RDD

In [ ]:
# now create your dataframe

In [7]:
data_df = sqlc.createDataFrame(data_rdd)
data_df.show()

Py4JJavaError: An error occurred while calling z:org.apache.spark.api.python.PythonRDD.runJob.
: org.apache.spark.SparkException: Job aborted due to stage failure: Task 0 in stage 1.0 failed 1 times, most recent failure: Lost task 0.0 in stage 1.0 (TID 1) (KKING executor driver): org.apache.spark.SparkException: Python worker failed to connect back.
	at org.apache.spark.api.python.PythonWorkerFactory.createSimpleWorker(PythonWorkerFactory.scala:189)
	at org.apache.spark.api.python.PythonWorkerFactory.create(PythonWorkerFactory.scala:109)
	at org.apache.spark.SparkEnv.createPythonWorker(SparkEnv.scala:124)
	at org.apache.spark.api.python.BasePythonRunner.compute(PythonRunner.scala:157)
	at org.apache.spark.api.python.PythonRDD.compute(PythonRDD.scala:65)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.scheduler.ResultTask.runTask(ResultTask.scala:90)
	at org.apache.spark.scheduler.Task.run(Task.scala:136)
	at org.apache.spark.executor.Executor$TaskRunner.$anonfun$run$3(Executor.scala:548)
	at org.apache.spark.util.Utils$.tryWithSafeFinally(Utils.scala:1504)
	at org.apache.spark.executor.Executor$TaskRunner.run(Executor.scala:551)
	at java.base/java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1144)
	at java.base/java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:642)
	at java.base/java.lang.Thread.run(Thread.java:1623)
Caused by: java.net.SocketTimeoutException: Accept timed out
	at java.base/sun.nio.ch.NioSocketImpl.timedAccept(NioSocketImpl.java:694)
	at java.base/sun.nio.ch.NioSocketImpl.accept(NioSocketImpl.java:738)
	at java.base/java.net.ServerSocket.implAccept(ServerSocket.java:690)
	at java.base/java.net.ServerSocket.platformImplAccept(ServerSocket.java:655)
	at java.base/java.net.ServerSocket.implAccept(ServerSocket.java:631)
	at java.base/java.net.ServerSocket.implAccept(ServerSocket.java:588)
	at java.base/java.net.ServerSocket.accept(ServerSocket.java:546)
	at org.apache.spark.api.python.PythonWorkerFactory.createSimpleWorker(PythonWorkerFactory.scala:176)
	... 14 more

Driver stacktrace:
	at org.apache.spark.scheduler.DAGScheduler.failJobAndIndependentStages(DAGScheduler.scala:2672)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$abortStage$2(DAGScheduler.scala:2608)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$abortStage$2$adapted(DAGScheduler.scala:2607)
	at scala.collection.mutable.ResizableArray.foreach(ResizableArray.scala:62)
	at scala.collection.mutable.ResizableArray.foreach$(ResizableArray.scala:55)
	at scala.collection.mutable.ArrayBuffer.foreach(ArrayBuffer.scala:49)
	at org.apache.spark.scheduler.DAGScheduler.abortStage(DAGScheduler.scala:2607)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$handleTaskSetFailed$1(DAGScheduler.scala:1182)
	at org.apache.spark.scheduler.DAGScheduler.$anonfun$handleTaskSetFailed$1$adapted(DAGScheduler.scala:1182)
	at scala.Option.foreach(Option.scala:407)
	at org.apache.spark.scheduler.DAGScheduler.handleTaskSetFailed(DAGScheduler.scala:1182)
	at org.apache.spark.scheduler.DAGSchedulerEventProcessLoop.doOnReceive(DAGScheduler.scala:2860)
	at org.apache.spark.scheduler.DAGSchedulerEventProcessLoop.onReceive(DAGScheduler.scala:2802)
	at org.apache.spark.scheduler.DAGSchedulerEventProcessLoop.onReceive(DAGScheduler.scala:2791)
	at org.apache.spark.util.EventLoop$$anon$1.run(EventLoop.scala:49)
	at org.apache.spark.scheduler.DAGScheduler.runJob(DAGScheduler.scala:952)
	at org.apache.spark.SparkContext.runJob(SparkContext.scala:2238)
	at org.apache.spark.SparkContext.runJob(SparkContext.scala:2259)
	at org.apache.spark.SparkContext.runJob(SparkContext.scala:2278)
	at org.apache.spark.api.python.PythonRDD$.runJob(PythonRDD.scala:166)
	at org.apache.spark.api.python.PythonRDD.runJob(PythonRDD.scala)
	at java.base/jdk.internal.reflect.DirectMethodHandleAccessor.invoke(DirectMethodHandleAccessor.java:104)
	at java.base/java.lang.reflect.Method.invoke(Method.java:578)
	at py4j.reflection.MethodInvoker.invoke(MethodInvoker.java:244)
	at py4j.reflection.ReflectionEngine.invoke(ReflectionEngine.java:357)
	at py4j.Gateway.invoke(Gateway.java:282)
	at py4j.commands.AbstractCommand.invokeMethod(AbstractCommand.java:132)
	at py4j.commands.CallCommand.execute(CallCommand.java:79)
	at py4j.ClientServerConnection.waitForCommands(ClientServerConnection.java:182)
	at py4j.ClientServerConnection.run(ClientServerConnection.java:106)
	at java.base/java.lang.Thread.run(Thread.java:1623)
Caused by: org.apache.spark.SparkException: Python worker failed to connect back.
	at org.apache.spark.api.python.PythonWorkerFactory.createSimpleWorker(PythonWorkerFactory.scala:189)
	at org.apache.spark.api.python.PythonWorkerFactory.create(PythonWorkerFactory.scala:109)
	at org.apache.spark.SparkEnv.createPythonWorker(SparkEnv.scala:124)
	at org.apache.spark.api.python.BasePythonRunner.compute(PythonRunner.scala:157)
	at org.apache.spark.api.python.PythonRDD.compute(PythonRDD.scala:65)
	at org.apache.spark.rdd.RDD.computeOrReadCheckpoint(RDD.scala:365)
	at org.apache.spark.rdd.RDD.iterator(RDD.scala:329)
	at org.apache.spark.scheduler.ResultTask.runTask(ResultTask.scala:90)
	at org.apache.spark.scheduler.Task.run(Task.scala:136)
	at org.apache.spark.executor.Executor$TaskRunner.$anonfun$run$3(Executor.scala:548)
	at org.apache.spark.util.Utils$.tryWithSafeFinally(Utils.scala:1504)
	at org.apache.spark.executor.Executor$TaskRunner.run(Executor.scala:551)
	at java.base/java.util.concurrent.ThreadPoolExecutor.runWorker(ThreadPoolExecutor.java:1144)
	at java.base/java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:642)
	... 1 more
Caused by: java.net.SocketTimeoutException: Accept timed out
	at java.base/sun.nio.ch.NioSocketImpl.timedAccept(NioSocketImpl.java:694)
	at java.base/sun.nio.ch.NioSocketImpl.accept(NioSocketImpl.java:738)
	at java.base/java.net.ServerSocket.implAccept(ServerSocket.java:690)
	at java.base/java.net.ServerSocket.platformImplAccept(ServerSocket.java:655)
	at java.base/java.net.ServerSocket.implAccept(ServerSocket.java:631)
	at java.base/java.net.ServerSocket.implAccept(ServerSocket.java:588)
	at java.base/java.net.ServerSocket.accept(ServerSocket.java:546)
	at org.apache.spark.api.python.PythonWorkerFactory.createSimpleWorker(PythonWorkerFactory.scala:176)
	... 14 more

#### LET'S CREATE A DATAFRAME FROM CSV FILE.

In [ ]:
# Read file

In [13]:
df = sqlc.read.format('com.databricks.spark.csv'). \
options(header = 'true', inferschema = 'true'). \
load ('./data/1000_Companies.csv')
type(df)

pyspark.sql.dataframe.DataFrame

In [11]:
# or
df = sqlc.read.csv('./data/1000_Companies.csv')

In [14]:
df.show(5)

+---------+--------------+---------------+----------+---------+
|R&D Spend|Administration|Marketing Spend|     State|   Profit|
+---------+--------------+---------------+----------+---------+
| 165349.2|      136897.8|       471784.1|  New York|192261.83|
| 162597.7|     151377.59|      443898.53|California|191792.06|
|153441.51|     101145.55|      407934.54|   Florida|191050.39|
|144372.41|     118671.85|      383199.62|  New York|182901.99|
|142107.34|      91391.77|      366168.42|   Florida|166187.94|
+---------+--------------+---------------+----------+---------+
only showing top 5 rows

In [15]:
df.printSchema()

root
 |-- R&D Spend: double (nullable = true)
 |-- Administration: double (nullable = true)
 |-- Marketing Spend: double (nullable = true)
 |-- State: string (nullable = true)
 |-- Profit: double (nullable = true)

In [16]:
#count number of rows or column

df.count() #number of rows.

1000

In [17]:
len(df.columns)

5

In [18]:
df.describe().show()

+-------+------------------+------------------+-----------------+----------+-----------------+
|summary|         R&D Spend|    Administration|  Marketing Spend|     State|           Profit|
+-------+------------------+------------------+-----------------+----------+-----------------+
|  count|              1000|              1000|             1000|      1000|             1000|
|   mean|        81668.9272|122963.89761169997|226205.0584188303|      null|119546.1646556102|
| stddev|46537.567891489154|12613.927534630999|91578.39354210423|      null|42888.63384847687|
|    min|               0.0|          51283.14|              0.0|California|          14681.4|
|    max|          165349.2|         321652.14|         471784.1|  New York|        476485.43|
+-------+------------------+------------------+-----------------+----------+-----------------+

In [16]:
df.describe(['R&D Spend', 'Administration']). show()

+-------+------------------+------------------+
|summary|         R&D Spend|    Administration|
+-------+------------------+------------------+
|  count|              1000|              1000|
|   mean|        81668.9272|122963.89761169997|
| stddev|46537.567891489154|12613.927534630999|
|    min|               0.0|          51283.14|
|    max|          165349.2|         321652.14|
+-------+------------------+------------------+

In [17]:
# convert to pandas 
df.toPandas()

     R&D Spend  Administration  Marketing Spend       State        Profit
0    165349.20      136897.800      471784.1000    New York  192261.83000
1    162597.70      151377.590      443898.5300  California  191792.06000
2    153441.51      101145.550      407934.5400     Florida  191050.39000
3    144372.41      118671.850      383199.6200    New York  182901.99000
4    142107.34       91391.770      366168.4200     Florida  166187.94000
..         ...             ...              ...         ...           ...
995   54135.00      118451.999      173232.6695  California   95279.96251
996  134970.00      130390.080      329204.0228  California  164336.60550
997  100275.47      241926.310      227142.8200  California  413956.48000
998  128456.23      321652.140      281692.3200  California  333962.19000
999  161181.72      270939.860      295442.1700    New York  476485.43000

[1000 rows x 5 columns]

# To check for null value

In [18]:
df.where(df['R&D Spend'].isNull()).show()

+---------+--------------+---------------+-----+------+
|R&D Spend|Administration|Marketing Spend|State|Profit|
+---------+--------------+---------------+-----+------+
+---------+--------------+---------------+-----+------+

In [20]:
# Selection : this is where you pick particular column to show
df1 = df['Administration', 'Marketing Spend']
df1.where(df['R&D Spend'].isNull()).show()

+--------------+---------------+
|Administration|Marketing Spend|
+--------------+---------------+
+--------------+---------------+

In [19]:
# Let's run Iris.csv
# for test cus it contains  null cells

In [20]:
dff2= sqlc.read.csv('C:/Users/Admin/DATA SCIENCE CLASS/data/iris_null.csv', header = True)
dff2.show(5)

+---+-------------+------------+-------------+------------+-----------+
| Id|SepalLengthCm|SepalWidthCm|PetalLengthCm|PetalWidthCm|    Species|
+---+-------------+------------+-------------+------------+-----------+
|  1|          5.1|         3.5|          1.4|         0.2|Iris-setosa|
|  2|          4.9|           3|          1.4|         0.2|Iris-setosa|
|  3|          4.7|         3.2|             |         0.2|Iris-setosa|
|  4|             |         3.1|          1.5|         0.2|Iris-setosa|
|  5|            5|         3.6|          1.4|         0.2|Iris-setosa|
+---+-------------+------------+-------------+------------+-----------+
only showing top 5 rows

In [38]:
dff2.where(dff2['Id'].isNull()).show()

+---+-------------+------------+-------------+------------+-------+
| Id|SepalLengthCm|SepalWidthCm|PetalLengthCm|PetalWidthCm|Species|
+---+-------------+------------+-------------+------------+-------+
+---+-------------+------------+-------------+------------+-------+

In [ ]:
# okay reading this all over again.

In [22]:
dff3 = sqlc.read.csv('C:/Users/Admin/DATA SCIENCE CLASS/data/iris_null.csv', header = True)
dff3.show(5)

+---+-------------+------------+-------------+------------+-----------+
| Id|SepalLengthCm|SepalWidthCm|PetalLengthCm|PetalWidthCm|    Species|
+---+-------------+------------+-------------+------------+-----------+
|  1|          5.1|         3.5|          1.4|         0.2|Iris-setosa|
|  2|          4.9|           3|          1.4|         0.2|Iris-setosa|
|  3|          4.7|         3.2|             |         0.2|Iris-setosa|
|  4|             |         3.1|          1.5|         0.2|Iris-setosa|
|  5|            5|         3.6|          1.4|         0.2|Iris-setosa|
+---+-------------+------------+-------------+------------+-----------+
only showing top 5 rows

In [32]:
# The first line dff3.where(dff3['SepallengthCm'].isNull()) is filtering the 
# rows of a DataFrame named dff3 where the value of the column 'SepallengthCm' is null or missing. 
# This will return a new DataFrame containing only the rows that satisfy this condition.

dff3.where(dff3['SepalWidthCm'].isNull())
dff3.show(9)

+---+-------------+------------+-------------+------------+-----------+
| Id|SepalLengthCm|SepalWidthCm|PetalLengthCm|PetalWidthCm|    Species|
+---+-------------+------------+-------------+------------+-----------+
|  1|          5.1|         3.5|          1.4|         0.2|Iris-setosa|
|  2|          4.9|           3|          1.4|         0.2|Iris-setosa|
|  3|          4.7|         3.2|             |         0.2|Iris-setosa|
|  4|             |         3.1|          1.5|         0.2|Iris-setosa|
|  5|            5|         3.6|          1.4|         0.2|Iris-setosa|
|  6|             |         3.9|          1.7|         0.4|Iris-setosa|
|  7|          4.6|         3.4|          1.4|         0.3|Iris-setosa|
|  8|             |         3.4|          1.5|         0.2|Iris-setosa|
|  9|          4.4|         2.9|          1.4|         0.2|Iris-setosa|
+---+-------------+------------+-------------+------------+-----------+
only showing top 9 rows

In [42]:
dff3.select('Id').dropna().count()

150

In [41]:
dff3.dropna().count()

150

In [43]:
dff3['Id'].isNull()

Column<'(Id IS NULL)'>

In [44]:
dff3_pandas = dff3.toPandas()
dff3_pandas.head()

  Id SepalLengthCm SepalWidthCm PetalLengthCm PetalWidthCm      Species
0  1           5.1          3.5           1.4          0.2  Iris-setosa
1  2           4.9            3           1.4          0.2  Iris-setosa
2  3           4.7          3.2           1.3          0.2  Iris-setosa
3  4           4.6          3.1           1.5          0.2  Iris-setosa
4  5             5          3.6           1.4          0.2  Iris-setosa

In [46]:
dff3_pandas.isnull()

        Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm  Species
0    False          False         False          False         False    False
1    False          False         False          False         False    False
2    False          False         False          False         False    False
3    False          False         False          False         False    False
4    False          False         False          False         False    False
..     ...            ...           ...            ...           ...      ...
145  False          False         False          False         False    False
146  False          False         False          False         False    False
147  False          False         False          False         False    False
148  False          False         False          False         False    False
149  False          False         False          False         False    False

[150 rows x 6 columns]

In [63]:
dff3_pandas.where(dff3_pandas['SepalLengthCm'].isnull())

      Id SepalLengthCm SepalWidthCm PetalLengthCm PetalWidthCm Species
0    NaN           NaN          NaN           NaN          NaN     NaN
1    NaN           NaN          NaN           NaN          NaN     NaN
2    NaN           NaN          NaN           NaN          NaN     NaN
3    NaN           NaN          NaN           NaN          NaN     NaN
4    NaN           NaN          NaN           NaN          NaN     NaN
..   ...           ...          ...           ...          ...     ...
145  NaN           NaN          NaN           NaN          NaN     NaN
146  NaN           NaN          NaN           NaN          NaN     NaN
147  NaN           NaN          NaN           NaN          NaN     NaN
148  NaN           NaN          NaN           NaN          NaN     NaN
149  NaN           NaN          NaN           NaN          NaN     NaN

[150 rows x 6 columns]

In [65]:
dff3.select ('SepalLengthCm').dropna().count()

150

In [33]:
dff3.select('SepalLengthCm', 'SepalLengthCm').fillna(1)

DataFrame[SepalLengthCm: string, SepalLengthCm: string]

In [35]:
# Assignment : To fill any null value on the column with 1. write the code
    
y = dff3.select('SepallengthCm').fillna('1')

from pyspark.sql.functions import isnan, when, count, col

y.select([count(when(isnan(i) | col(i).isNull(), i)).alias(i) for i in
y.columns]).show()

+-------------+
|SepallengthCm|
+-------------+
|            0|
+-------------+

The na.fill() method is used to replace all null or missing values in a DataFrame or Series with a specified value. In this case, the specified value is a dictionary containing column names and their respective replacement values.

In [53]:
# to assign different number to the null value to respective number.
zee = dff3.fillna({'SepalLengthCm': 8, 'PetalWidthCm': 0.20, 'SepalWidthCm': 20})

In [54]:
from pyspark.sql.functions import isnan, when, count, col

zee.select([count(when(isnan(i) | col(i).isNull(), i)).alias(i) for i in
zee.columns]).show()

+---+-------------+------------+-------------+------------+-------+
| Id|SepalLengthCm|SepalWidthCm|PetalLengthCm|PetalWidthCm|Species|
+---+-------------+------------+-------------+------------+-------+
|  0|            0|           0|            0|           0|      0|
+---+-------------+------------+-------------+------------+-------+

In [ ]:
zee.show(20)

+---+-------------+------------+-------------+------------+-----------+
| Id|SepalLengthCm|SepalWidthCm|PetalLengthCm|PetalWidthCm|    Species|
+---+-------------+------------+-------------+------------+-----------+
|  1|          5.1|         3.5|          1.4|         0.2|Iris-setosa|
|  2|          4.9|           3|          1.4|         0.2|Iris-setosa|
|  3|          4.7|         3.2|             |         0.2|Iris-setosa|
|  4|             |         3.1|          1.5|         0.2|Iris-setosa|
|  5|            5|         3.6|          1.4|         0.2|Iris-setosa|
|  6|             |         3.9|          1.7|         0.4|Iris-setosa|
|  7|          4.6|         3.4|          1.4|         0.3|Iris-setosa|
|  8|             |         3.4|          1.5|         0.2|Iris-setosa|
|  9|          4.4|         2.9|          1.4|         0.2|Iris-setosa|
| 10|          4.9|         3.1|          1.5|         0.1|Iris-setosa|
| 11|          5.4|            |             |         0.2|Iris-setosa|
| 12|          4.8|         3.4|          1.6|         0.2|Iris-setosa|
| 13|             |           3|             |         0.1|Iris-setosa|
| 14|          4.3|           3|          1.1|         0.1|Iris-setosa|
| 15|          5.8|           4|          1.2|         0.2|Iris-setosa|
| 16|          5.7|         4.4|          1.5|         0.4|Iris-setosa|
| 17|          5.4|         3.9|          1.3|         0.4|Iris-setosa|
| 18|          5.1|         3.5|          1.4|         0.3|Iris-setosa|
| 19|          5.7|         3.8|          1.7|         0.3|Iris-setosa|
| 20|          5.1|         3.8|          1.5|         0.3|Iris-setosa|
+---+-------------+------------+-------------+------------+-----------+
only showing top 20 rows

# CORRELATION

In [56]:
# # CORRELATION
# it checks how two variable correlate between eachother
# it checks the effect a change in variableA on variableB

# it is called by "Corr"

The corr() method in PySpark is used to calculate the correlation between two columns in a DataFrame. The correlation coefficient is a measure of the strength and direction of the linear relationship between two variables. The corr() method can be used in several ways:

Correlation between two columns in a DataFrame:

In [58]:
from pyspark.sql.functions import corr

# Create a SparkSession object
spark = SparkSession.builder.appName("MyApp").getOrCreate()

# Load the DataFrame
df = spark.read.csv("C:/Users/Admin/DATA SCIENCE CLASS/data/iris_null.csv", header=True, inferSchema=True)

# Calculate the correlation between two columns
corr_coeff = df.select(corr("SepalLengthCm", "SepalWidthCm")).collect()[0][0]

print("Correlation coefficient between col1 and col2:", corr_coeff)

Correlation coefficient between col1 and col2: -0.09582879574532006

In [ ]:
# Question: What does that correlation really mean. and what is it's usefulness.

### EXAMPLES OF OTHER CORRELATION USES

In [62]:
# Calculate the correlation between two columns of a DataFrame:

from pyspark.sql.functions import corr

# Load the DataFrame
df = spark.read.csv("C:/Users/Admin/DATA SCIENCE CLASS/data/iris_null.csv", header=True, inferSchema=True)

# Calculate the correlation between two columns
corr_coeff = df.select(corr("SepalLengthCm", "SepalWidthCm")).collect()[0][0]
corr_coeff

# This code reads a CSV file into a DataFrame using spark.read.csv, then 
# calculates the correlation between two columns using the corr function and 
# stores the result in the corr_coeff variable.

-0.09582879574532006

In [72]:
# Calculate the correlation between multiple columns of a DataFrame:

from pyspark.sql.functions import corr

# Load the DataFrame
df = spark.read.csv("C:/Users/Admin/DATA SCIENCE CLASS/data/iris_null.csv", header=True, inferSchema=True)

# Calculate the correlation between multiple columns
corr_coeffs = df.select([corr("SepalLengthCm", "SepalWidthCm") for SepalLengthCm in df.columns for SepalWidthCm in df.columns]).collect()
corr_coeffs
# This code reads a CSV file into a DataFrame using spark.read.csv, 
# then calculates the correlation between each pair of columns using nested
# list comprehension and the corr function. The result is stored in the 
# corr_coeffs variable as a list of correlation coefficients.

[Row(corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006, corr(SepalLengthCm, SepalWidthCm)=-0.09582879574532006)]

In [1]:
#MACHINE LEARNING!!! #MACHINE LEARNING!! #MACHINE LEARNING!
#May 9

# ARTIFICIAL INTELLIGENCE